package com.example.myapplication;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.TextView;


public class Main2Activity extends AppCompatActivity {
    DataFood a1,a2,a3,a4,a5,a6,a7,a8,a9,a10,a11,a12,a13,a14,a15,a16,a17,a18,a19,a20
            ,a21,a22,a23,a24,a25,a26,a27,a28,a29,a30,a31,a32,a33,a34,a35,a36,a37,a38,a39,a40
            ,a41,a42,a43,a44,a45,a46,a47,a48,a49,a50;
    private TextView order;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main2);

        a1 = new DataFood();
        a1.setName("ต้มยำกุ้ง");
        a1.setLmage((int)R.drawable.a1);
        a1.setName1("ส่วนผสม");
        a1.setData1("* กุ้งขนาดกลาง 6 ตัว\n" +
                "* ตะไคร้ 1 ต้น,หั่นเป็นท่อนและทุบพอแหลก\n" +
                "* เห็ดฟางหั่นครึ่ง 12 ดอก\n" +
                "* พริกขี้หนู 3-5 เม็ด, บุบพอแตก\n" +
                "* ใบมะกรูดฉีก 3 ใบ\n" +
                "* น้ำมะนาว 2-3 ช้อนโต๊ะ\n" +
                "* น้ำปลา 2-3 ช้อนโต๊ะ\n" +
                "* น้ำซุปไก่ 3 ถ้วย (หรือน้ำเปล่า)\n" +
                "* ผักชี สำหรับโรยหน้า\n" +
                "* น้ำพรกเผา (กรณีต้องการทำเป็นต้มยำน้ำข้น)");
        a1.setName2("ขั้นตอนการทำ");
        a1.setData2("1. ล้างทำความสะอาดกุ้ง แกะเปลือกออกเหลือแต่หาง พักไว้ (ถ้าไม่มีน้ำซุปไก่ สามารถเอาหัวกุ้ง\n" +
                " และเปลือกที่แกะ ไปต้มทำเป็น น้ำซุป จะทำให้ต้มยำมีรสกลมกล่อมขึ้น)\n" +
                "2. ตั้งน้ำซุป (หรือน้ำเปล่า) ในหม้อขนาดกลาง ใส่ตะไคร้ลงไปต้ม พอน้ำซุปเริ่มเดือด ใส่กุ้งและเห็ดฟาง ต้มต่อไปอีกสักพักจนกุ้งเกือบสุก จึงปิดไฟ ยกหม้อลง (อย่าให้กุ้งสุกมาก เนื้อจะแข็งกระด้าง ไม่อร่อย)\n" +
                "3. ปรุงรสด้วยพริก,น้ำมะนาวและ น้ำปลา จากนั้นจึงฉีกใบมะกรูดใส่ลงไปคลุกให้ทั่วชิมรสให้พอดี (ถ้าต้องการทำเป็นต้มยำน้ำข้น ก็ใส่น้ำพริกเผาลงไปด้วย)\n" +
                "4. ตักต้มยำใส่ถ้วย โรยหน้าด้วยผักชี เสริฟทันทีพร้อมข้าวสวยร้อนๆ");

        a2 = new DataFood();
        a2.setName("ไข่ลูกเขย");
        a2.setLmage((int)R.drawable.a2);
        a2.setName1("ส่วนผสม");
        a2.setData1("* ไข่เป็ด 4 ฟอง (เทคนิคการต้มไข่)\n" +
                "* หอมเจียว 2 ช้อนโต้ะ (เทคนิคการเจียวหอม)\n" +
                "* ผักชีซอย 1 ช้อนโต้ะ\n" +
                "* น้ำตาลปี๊บ 4 ช้อนโต้ะ\n" +
                "* เกลือ 1 ช้อนชา\n" +
                "* น้ำมะขามเปี๊ยก 2 ช้อนโต้ะ\n" +
                "* น้ำปลา 2 ช้อนโต้ะ\n" +
                "* พริกไทยป่น 1 ช้อนโต้ะ\n" +
                "* น้ำซุปหมู 5 ช้อนโต้ะ\n" +
                "* น้ำมัน 1 ถ้วย\n" +
                "* พริกทอด 4-5 เม็ด");
        a2.setName2("ขั้นตอนการทำ");
        a2.setData2("1.เตรียมต้มไข่เป็ด โดยต้มให้เป็นไข่ยางมะตูม อย่าต้มให้ไข่แดงสุก เอาแต่ไข่ขาวแข็ง เป็นลูกได้ เนื่องจากเราจะนำไปทอดต่อ จากนั้นนำไข่เป็ดไปแช่น้ำแข็ง ให้ไข่หดตัว จะได้ปลอกเปลือกง่าย\n" +
                "2.ตั้งกระทะน้ำมัน ให้น้ำมันท่วมไข่ ตั้งไฟให้ร้อน นำไข่ต้มลงไปทอด ให้ไข่เหลือง จากนั้นพักเอาไว้ก่อน\n" +
                "3.เตรียมน้ำราด โดย ตั้งกระทะน้ำมัน นำน้ำตาลลงไปคั่วให้สีเปลี่ยนเป็นสีน้ำตาล จากนั้นเติมน้ำซุปลงไป\n" +
                "4.ปรุงรสด้วย เกลือ น้ำปลา พริกไทย น้ำมะขามเปียก จากนั้นเคี่ยวให้น้ำราดเริ่มเหนียว ก็สามารถจัดจานได้\n" +
                "5.เสริฟไข่ลูกเขยโดย จัดไข่ทอด ฝ่าคลึ่ง ลงบนจาน โรยหน้าด้วย หอมเจียว พริกทอด และผักชี สุดท้าย ราดซอส");

        a3 = new DataFood();
        a3.setName("ต้มข่าไก่");
        a3.setLmage((int)R.drawable.a3);
        a3.setName1("ส่วนผสม");
        a3.setData1("* เนื้ออกไก่ 3 ชิ้น (หั่นเป็นชิ้นพอดีคำ)\n" +
                "* กะทิ 2 ถ้วยตวง\n" +
                "* น้ำซุปไก่ 1 ถ้วยตวง\n" +
                "* ข่าขนาดกลาง 2-3 ชิ้น (ปอกเปลือกและหั่นบางๆ)\n" +
                "* พริกขี้หนูซอยละเอียด 1 ช้อนโต๊ะ\n" +
                "* น้ำปลา 1 ช้อนโต๊ะ\n" +
                "* น้ำตาล 1 ช้อนชา\n" +
                "* ใบผักชี 1/2 ถ้วยตวง (สำหรับแต่งหน้า)\n");
        a3.setName2("ขั้นตอนการทำ");
        a3.setData2("1. ใส่กะทิและน้ำซุปไก่ลงในหม้อและนำไปตั้งไฟร้อนปานกลาง\n" +
                "2. ต้มประมาณ 8 นาที และคนเป็นครั้งคราว\n" +
                "3. ใส่เนื้อไก่และพริกลงไปในหม้อ ต้มต่อไปอีกประมาณ 6 นาที คนต่อไปจนเนื้อไก่สุกดี\n" +
                "4. ปรุงรสด้วยน้ำปลาและน้ำตาล จากนั้นใส่ผักชีแล้วจึงเสิรฟพร้อมข้าวสวยร้อนๆ");


        a4 = new DataFood();
        a4.setName("ผัดเผ็ดหมูป่า");
        a4.setLmage((int)R.drawable.a4);
        a4.setName1("ส่วนผสม");
        a4.setData1("* หมูป่า 200 กรัม (หั่นเป็นชิ้น)\n" +
                " * น้ำพริกแกงเผ็ด 2 ช้อนโต๊ะ\n" +
                " * พริกชี้ฟ้าแดง 3 เม็ด (หั่นแฉลบ)\n" +
                " * กระชายหั่นฝอย 3 ช้อนโต๊ะ\n" +
                " * มะเขือพวง 1/4 ถ้วยตวง\n" +
                " * ใบมะกรูด 3-5 ใบ (ฉีกเป็นชิ้นๆ)\n" +
                " * พริกไทยอ่อน 3 ช้อนโต๊ะ\n" +
                " * น้ำตาล 1 ช้อนโต๊ะ\n" +
                " * กะทิ 1/4 ถ้วยตวง\n" +
                " * น้ำเปล่า 1/4 ถ้วยตวง\n" +
                " * น้ำปลา 1 ช้อนโต๊ะ\n" +
                " * น้ำมันสำหรับผัด\n" +
                " * ใบมะกรูด 1 ใบ (หั่นฝอยสำหรับแต่งหน้า)");
        a4.setName2("ขั้นตอนการทำ");
        a4.setData2("1. ตั้งน้ำมันในกระทะบนไฟร้อนปานกลาง ใส่น้ำพริกแกงเผ็ด ลงไปผัดจนหอม จากนั้นจึงใส่เนื้อหมูลงไปผัด\n" +
                "\n" +
                "2. ผัดจนเนื้อหมูเกือบสุก จึงใส่มะเขือพวง, กระชาย, พริกชี้ฟ้า, พริกไทยอ่อน และใบมะกรูดฉีก ใส่น้ำเปล่าลงไปผัดด้วย ผัดให้เข้ากัน\n" +
                "\n" +
                "3. จากนั้นใส่กะทิ และปรุงรสด้วยน้ำปลา และน้ำตาลทราย ปรับไฟแรงขึ้นผัดอย่างรวดเร็ว จนส่วนผสมทุกอย่างเข้ากันดี จึงปิดไฟ\n" +
                "\n" +
                "4. ตักใส่จาน โรยหน้าด้วยใบมะกรูหั่นฝอย เสริฟทันทีขณะร้อนๆ พร้อมข้าวสวย หรือจะเสริฟเป็นกับแกล้มก็ดี\n");


        a5 = new DataFood();
        a5.setName("ปลากะพงนึ่งมะนาว");
        a5.setLmage((int)R.drawable.a5);
        a5.setName1("ส่วนผสม");
        a5.setData1("* ปลากระพง 1 ตัว\n" +
                "* น้ำปลา 3 ช้อนโต้ะ\n" +
                "* ซอสถั่วเหลือง 2 ช้อนโต้ะ\n" +
                "* น้ำมะนาว 5 ช้อนโต้ะ\n" +
                "* น้ำตาล 1 ช้อนโต้ะ\n" +
                "* น้ำซุป 5 ช้อนโต้ะ\n" +
                "* กระเทียม ซอย 1 ช้อนโต้ะ\n" +
                "* พริกสด ซอย 1 ช้อนโต้ะ\n" +
                "* มะนาว ฝานบางๆ 4-5 ชิ้น\n" +
                "* ผักชี ซอย สำหรับโรยหน้า");
        a5.setName2("ขั้นตอนการทำ");
        a5.setData2("1.ทำความสะอาด ปลา ขอดเกล็ด ล้างไส้ เครื่องในปลาให้สะอาด จากนั้นนำมาพักใส่จาน\n" +
                "2.เตรียมน้ำซอสมะนาว โดย ผสม ซอสถั่วเหลือง น้ำตาล น้ำปลา มะนาว ซุป กระเทียม และ พริกสด ผสมให้ส่วนผสมเข้ากัน\n" +
                "3.ราดน้ำซอสมะนาวในปลากระพงที่เตรียมไว้ จากนั้นนำไปนึ่ง 20 ถึง 30 นาที ให้เนื้อปลาสุก\n" +
                "4.เสริฟปลากระพงนึ่งมะนาว โรยหน้าด้วย มะนาว ฝาน และ ผักชี");

        a6 = new DataFood();
        a6.setName("ผัดคะน้าหมูกรอบ");
        a6.setLmage((int)R.drawable.a6);
        a6.setName1("ส่วนผสม");
        a6.setData1("* ยอดผักคะน้า หั่นยาวพอคำ 1 ถ้วย\n" +
                "* หมูกรอบ หั่นพอคำ ครึ่งถ้วย\n" +
                "* พริกสด บด 1 ช้อนโต้ะ\n" +
                "* กระเทียม บด 1 ช้อนโต้ะ\n" +
                "* ซอสน้ำมันหอย 1 ช้อนโต้ะ\n" +
                "* เต้าเจี้ยวบดอย่างดี 1 ช้อนโต้ะ\n" +
                "* ซอสถั่วเหลือง 1 ช้อนโต้ะ\n" +
                "* น้ำตาล 1 ช้อนชา\n" +
                "* น้ำมันพืช สำหรับผัด 2 ช้อนโต้ะ\n" +
                "* น้ำซุป 1 ทัพพี");
        a6.setName2("ขั้นตอนการทำ");
        a6.setData2("1.เตรียมหมูกรอบ หั่นหมูกรอบให้มีขนาดพอดีคำ ซึ่งหมูกรอบที่อร่อยต้อง เนื้อนุ่ม มีรสชาติ หนังกรอบ เทคนิคการทำหมูกรอบที่อร่อยต้องนำหมูมาหมัก ส่วนผสมของ รากผักชี กระเทียม พริกไทย และ ซอสปรุงรส จากนั้นนำไปนึ่ง พักให้หนังแห้ง จากนั้นนำส่วนหนังหมูลงไปทอด ให้กรอบ\n" +
                "2.การผัดคะน้าหมูกรอบนั้น เหมือนกับการทำผัดผักบุ้งไฟแดง ให้ใส่ส่วนผสมทั้งหมดลงไปผัด เพื่อให้ เครื่องปรุง และ ผักคะน้าสุกพอดี โดยตั้งกระทะน้ำมัน รอให้ไฟและกระทะร้อน จากนั้นใส่ ผักคะน้า หมูกรอบ พริก กระเทียม ซอสน้ำมันหอย เต้าเจี้ยว ซอสถั่วเหลือง น้ำตาล ลงไปผัดพร้อมกัน ผัดให้ส่วนผสมเข้ากัน\n" +
                "3.ใส่ น้ำซุป ลงไปในกระทะและผัดอีกสักครู่และเสริฟ ทานคู่กับ พริกน้ำปลา กับข้าวง่ายๆ เมนูผัดคะน้า");

        a7 = new DataFood();
        a7.setName("หมูมะนาว");
        a7.setLmage((int)R.drawable.a7);
        a7.setName1("ส่วนผสม");
        a7.setData1("* หมูสไลด์ 1 ถ้วย\n" +
                "* กระเทียมบด 2 ช้อนโต้ะ\n" +
                "* พริกบด 2 ช้อนโต้ะ\n" +
                "* ผักชี\n" +
                "* น้ำปลา 2 ช้อนโต้ะ\n" +
                "* น้ำตาล 1 ช้อนโต้ะ\n" +
                "* น้ำมะนาวสด 2 ช้อนโต้ะ\n" +
                "* กะหล่ำปลีหั่นฝอย 5 ช้อนโต้ะ");
        a7.setName2("ขั้นตอนการทำ");
        a7.setData2("1.ลวกหมูให้สุก\n" +
                "2.เอากะหล่ำปลีใส่จานและเอาหมูลวกวางบนจาน\n" +
                "3.ทำน้ำยำ โดย ผสม กระเทียม พริก น้ำตาล น้ำปลา มะนาว ให้เข้ากัน และเทบนจานหมูที่เตรียมไว้\n" +
                "4.โรยหน้าด้วยผักชี");

        a8 = new DataFood();
        a8.setName("ไก่ต้มน้ำปลา");
        a8.setLmage((int)R.drawable.a8);
        a8.setName1("ส่วนผสม");
        a8.setData1("* ไก่สด 1 ตัว\n" +
                "* รากผักชีบด 2 ช้อนโต้ะ\n" +
                "* ข่าหั่นแว่น 2 ชิ้น\n" +
                "* ตะไคร้ 1 ต้น\n" +
                "* ใบมะกรูด 2 ใบ\n" +
                "* น้ำตาลปี๊บ 3 ช้อนชา\n" +
                "* น้ำปลา 1 ถ้วย\n" +
                "* ซอสถั่วเหลือง 1 ถ้วย\n" +
                "* ซอสดำ 3 ช้อนชา\n" +
                "* น้ำเปล่า 3 ถ้วย");
        a8.setName2("ขั้นตอนการทำ");
        a8.setData2("1.ต้มน้ำให้เดือด ใส่ รากผักชีก ตะไคร้ ข่า และ ใบมะกรูด ลงไป\n" +
                "2.ปรุงรสด้วย น้ำปลา ซอสถั่วเหลือง ซอสดำ น้ำตาล\n" +
                "3.น้ำจิ้มสำหรับ กินกับไก่ต้ม สูตรน้ำปลา นั้น เป็นส่วนประกิบหลักสำหรับความอร่อย ส่วนประกอบของ น้ำจิ้ม ประกอบด้วย น้ำตาล น้ำปลา พริก กระเทียม และ น้ำมะนาว ให้ผสมน้ำจิ้ม และ เตรียมไว้ สำหรับกินกับไก่ต้ม\n" +
                "4.ใส่ ไก่ ลงไปต้ม 45 นาที จากน้ันนำไก่ออกมาพักให้สะเด็ดน้ำและคายความร้อน เสริฟรับประทานได้");

        a9 = new DataFood();
        a9.setName("ต้มยำรวมมิตรทะเล");
        a9.setLmage((int)R.drawable.a9);
        a9.setName1("ส่วนผสม");
        a9.setData1("* กุ้งสด 2 – 3 ตัว\n" +
                "* ปลาหมึก หั่นเป็นชิ้น 1 ตัว\n" +
                "* ปลาทะเล เป็นชิ้นพอคำ 2 – 3 ชิ้น\n" +
                "* หอยแมลงภู่ 3 – 4 ตัว\n" +
                "* ไข่ต้ม 1 ฟอง\n" +
                "* น้ำพริกเผา 1 ช้อนโต้ะ\n" +
                "* น้ำปลา 2 ช้อนโต้ะ\n" +
                "* น้ำมะขามเปียก 1 ช้อนโต้ะ\n" +
                "* น้ำมะนาว 1 ช้อนโต้ะ\n" +
                "* พริกสด 1 ช้อนโต้ะ\n" +
                "* นมค้นจืด 1 ช้อนโต้ะ\n" +
                "* ใบมะกรูด 3 ใบ\n" +
                "* น้ำซุปหมู 2 ถ้วย\n" +
                "* ข่า หั่นเป็นชิ้น 2 – 3 ชิ้น\n" +
                "* ตะไคร้ หั่นเป็นท่อน 2 – 3 ชิ้น\n" +
                "* หอมแดง ผ่าครึ่ง 2 ลูก\n" +
                "* ผักชีฝรั่ง ซอยหยาบ 2 ช้อนโต้ะ");
        a9.setName2("ขั้นตอนการทำ");
        a9.setData2("1.ต้มน้ำให้เดือด จากนั้นนำกุ้ง ปลา ปลาหมึก และหอยลงไปลวกให้สุก จากนั้นพักไว้ก่อน ความอร่อยของต้มยำทะเล อยู่ที่เนื้อสัตว์สุกเท่ากันทุกประเภท ดังนั้นการนำเนื้อสัตว์มาลวกก่อน จะทำให้เนื้อสัตว์ทุกประเภทที่นำมาทำสุกเท่ากัน ทำให้ไม่เสียรสชาติของอาหารทะเล\n" +
                "2.ต้มน้ำซุปหมู จากนั้นใส่ ข่า ตะไคร้ หอมแดง และใบมะกรูด(ฉีกใบไม่เอาแกนใบ) ต้มด้วยไฟอ่อนๆ ให้ได้กลิ่นหอมของสมุนไพรออกมาก่อน\n" +
                "3.ปรุงรสด้วย พริกสด น้ำปลา น้ำมะขามเปียก และพริกเผา จากนั้นเร่งไฟให้แรงขึ้น\n" +
                "4.ใส่ผักชีฝรั่งลงไป ใส่ กุ้ง ปลา หอย ปลาหมึก และปิดไฟ จากนั้นเติมนมข้นจืด และน้ำมะนาวลงไป ชิมรสชาติและแต่งรสชาติตามใจชอบ\n" +
                "5.เสริฟต้มยำรวมมิตรทะเล วางไข่ต้มด้านบน กับข้าวไทย เมนูสุขภาพ อาหารจานเดียว");

        a10 = new DataFood();
        a10.setName("มะระอบไอน้ำ");
        a10.setLmage((int)R.drawable.a10);
        a10.setName1("ส่วนผสม");
        a10.setData1("* มะระ หั่นท่อน 3-4 ท่อน\n" +
                "* เนื้อหมูบด 1 กิโลกรัม\n" +
                "* มันหมูบด 1 กิโลกรัม\n" +
                "* ซอสน้ำมันหอย 5 ช้อนโต้ะ\n" +
                "* ซอสปรุงรส 5 ช้อนโต้ะ\n" +
                "* ซีอิ้วขาว 5 ช้อนโต้ะ\n" +
                "* พริกไทย 3 ช้อนโต้ะ\n" +
                "* รากผักชี บด 3 ช้อนโต้ะ\n" +
                "* เห็ดหอมหั่น 5 ช้อนโต้ะ\n" +
                "* วุ้นเส้นหั่น 10 ช้อนโต้ะ\n" +
                "* เกลือ 1/2 กิโลกรัม");
        a10.setName2("ขั้นตอนการทำ");
        a10.setData2("1.นำ มะระ มาควานไส้ขาวๆออกให้หมด ล้างน้ำให้สะอาด จากนั้นนำไปต้มในน้ำเกลือ 15 นาที และนำไปแช่ในน้ำเย็น และพักใส่จานเอาไว้ก่อน\n" +
                "2.เตรียมไส้ นำ หมูสับ และ มันหมูบด มาผสมให้ส่วนผสมเข้ากัน ปรุงรสด้วย ซอสหอยนางรม ซอสปรุงรส และ ซีอิ้วขาว อย่างละ 3 ช้อนโต้ะ ตามด้วย วุ้นเส้น เห็ดหอม รากผักชี และ พริกไทย นวดให้ให้ส่วนผสมเข้ากัน นำไปแช่เย็นในตู้เย็น 30 นาที\n" +
                "3.จากนั้นนำ หมูบด มายัดไส้ มะระ ที่ต้มเอาไว้แล้ว\n" +
                "4.ราดซอสหอยนางรม ซอสปรุงรส และ ซีอิ้วขาว อย่างละ 2 ช้อนโต้ะ บนจาน มะระ ที่ยัดไส้ไว้แล้ว\n" +
                "5.นำไปนึ่งเป็นเวลา 2 ชั่วโมง ก็สามารถรับประทานได้");

        a11 = new DataFood();
        a11.setName("ไก่ทอดกระเทียมพริกไทย");
        a11.setLmage((int)R.drawable.a11);
        a11.setName1("ส่วนผสม");
        a11.setData1("* เนื้อไก่ หั่นเป็นชิ้นพอคำ 1 จาน\n" +
                "* กระเทียม บด 1 ช้อนโต้ะ\n" +
                "* พริกไทยป่น 1 ช้อนโต้ะ\n" +
                "* ผงปรุงรส 1 ช้อนชา\n" +
                "* น้ำตาลทราย 1 ช้อนชา\n" +
                "* ซอสน้ำมันหอย 1 ช้อนโต้ะ\n" +
                "* ซอสปรุงรส 1 ช้อนโต้ะ\n" +
                "* น้ำมันพืช สำหรับทอด");
        a11.setName2("ขั้นตอนการทำ");
        a11.setData2("1.เริ่มจากการหมักเนื้อไก่ โดยเตรียมจาน ใส่ เนื้อไก่ กระเทียม พริกไทย ผงปรุงรส น้ำตาลทราย ซอยน้ำมันหอย และ ซอสปรุงรส คลุกให้เข้ากัน หมักไว้สัก 5 นาที\n" +
                "2.ตั้งกระทะน้ำมันให้ร้อน สำหรับทอด จากนั้นนำเนื้อไก่ที่หมักกระเทียมพริกไทย ลงไปทอดขั้นตอนนี้ ใส่ไก่ลงไป ทอดทิ้งไว้ให้สุก จากนั้นตักส่วนผสมทั้งหมดขึ้นมาพักให้น้ำมันแห้ง\n" +
                "3.เสร็จสิ้น ไก่ทอดกระเทียมพริกไทย เสริฟกับข้าวสวยร้อนๆ ทานคู่กับซอสพริกอร่อยๆ");

        a12 = new DataFood();
        a12.setName("ปลาราดพริก");
        a12.setLmage((int)R.drawable.a12);
        a12.setName1("ส่วนผสม");
        a12.setData1("* ปลานิล 1 ตัว\n" +
                "* แป้งมัน 2 ช้อนโต้ะ\n" +
                "* น้ำมันพืช 1 ถ้วย\n" +
                "* กระเทียมบด 3 ช้อนโต้ะ\n" +
                "* พริกสดบด 3 ช้อนโต้ะ\n" +
                "* น้ำตาล 5 ช้อนโต้ะ\n" +
                "* ผักชี\n" +
                "* น้ำปลา 1 ช้อนโต้\n" +
                "* ผักสลัด");
        a12.setName2("ขั้นตอนการทำ");
        a12.setData2("1.นำปลามาโรยแป้งให้ทั่ว และทอดปลาในกระทะน้ำมันจนกรอบ ปลาเป็นสีเหลือง\n" +
                "2.นำผักสลัดวางลงในจานและนำปลาที่สอดเสร็จแล้ววางบนจาน\n" +
                "3.เตรียมน้ำซอสโดย ตั้งกระทะร้อนปานกลาง ใส่ กระเทียม น้ำตาล น้ำปลา และพริกสดลงไปผัดใส่น้ำนิดหน่อยผัดจนเหนียว\n" +
                "4.นำซอสไปราดปลาที่เตรียมไว้ในจาน ทานกับข้าวหอมมะลิไทย");

        a13 = new DataFood();
        a13.setName("ปลาช่อนลุยสวน");
        a13.setLmage((int)R.drawable.a13);
        a13.setName1("ส่วนผสม");
        a13.setData1("* ปลาช่อน 1 ตัว\n" +
                "* พริกขี้หนูบด 1 ช้อนโต๊ะ\n" +
                "* น้ำมะนาว 2 ช้อนโต๊ะ\n" +
                "* น้ำตาล 2 ช้อนโต๊ะ\n" +
                "* น้ำปลา 3 ช้อนโต๊ะ\n" +
                "* ผักชีฝรั่งหั่นฝอย 2 ช้อนโต้ะ\n" +
                "* ผักชีหั่นฝอย 2 ช้อนโต้ะ\n" +
                "* ใบสาระแหน่ 2 ช้อนโต้ะ\n" +
                "* ตะไคร้หั่น 2 ช้อนโต๊ะ\n" +
                "* หอมแดงซอย 4 ช้อนโต๊ะ\n" +
                "* มะนาวหั่นเป็นสี่เหลี่ยมลูกเต๋าพร้อมเปลือก 3 ช้อนโต๊ะ\n" +
                "* น้ำมันพืช 4 ถ้วยตวง");
        a13.setName2("ขั้นตอนการทำ");
        a13.setData2("1.ตั้งน้ำมันให้ร้อน นำปลาช่อนลงไปทอดปลาให้เหลือง นำปลามาสะเด็ดน้ำมัน จัดใส่จาน\n" +
                "2.ทำน้ำยำ โดย ดยผสมน้ำมะนาว น้ำปลา น้ำตาล หอมแดงหั่น ตะไคร้หั่น ผักชีหั่น ผักชีฝรั่งหั่น เปลือกมะนาวหั่นเป็นลูกเต๋าและพริกขี้หนู ผสมให้เข้ากัน\n" +
                "3.ราดน้ำยำลงบนจานปลาช่อนลุยสวนที่จัดไว้แล้ว");

        a14 = new DataFood();
        a14.setName("ต้มจืดฟักซี่โครงหมู");
        a14.setLmage((int)R.drawable.a14);
        a14.setName1("ส่วนผสม");
        a14.setData1("* ซี่โครงหมู ส่วนหลังหั่นเป็นชิ้น 1/2 กิโลกรัม\n" +
                "* ฟักเขียวอ่อน ปลอกเปลือก และ เอาเมล็ดออก หั่นเป็นชิ้นพอคำ 1 จาน\n" +
                "* แครอทหั่นเป็นแผ่น 4-5 ชิ้น\n" +
                "* เห็ดหอม 4-5 ดอก\n" +
                "* เกลือ 1 ช้อนชา\n" +
                "* ซอสถั่วเหลือง 2 ช้อนโต้ะ\n" +
                "* รากผักชี 1 ต้น\n" +
                "* พริกไทยแห้งเม็ด 1 ช้อนชา\n" +
                "* กระเทียมสด 2-3 กลีบ\n" +
                "* น้ำปล่า 2-3 ลิตร");
        a14.setName2("ขั้นตอนการทำ");
        a14.setData2("1.ตั้งหม้อต้มน้ำให้เดือด จากนั้นใส่ ซี่โครงหมูลงไปต้ม ด้วยไฟอ่อนๆ 2-3 ชั่วโมง ต้มให้น้ำซุปหวานกระดูก และ เนื้อซี่โครงหมูนุ่ม เมื่อเราได้น้ำซุปที่หวานพร้อมจะต้มแกงจืดแล้ว จะมาทำแกงจืดฟักซี่โครงหมูกัน\n" +
                "2.ตั้งกระทะ ใส่น้ำมันเล็กน้อย นำพริกไทย กระเทียม และ รากผักชีลงไปผัด ให้ได้กลิ่นหอม จากนั้นใส่น้ำซุปลงไปต้ม\n" +
                "3.ใส่ แครอท เห็ดหอม และ ฟักเขียวลงไปต้ม ในน้ำเดือดๆ\n" +
                "4.เมื่อฟักเริ่มใส ให้ ปรุงรสด้วย เลือก และ ซอสถั่วเหลือง เมื่อรสชาติได้ที่ ให้ใส่ซี่โครงหมูลงไปต้มในน้ำแกง\n" +
                "5.เสริฟใส่ชาม พร้อมสำหรับรับประทาน กับข้าวสวยร้อนๆ");

        a15 = new DataFood();
        a15.setName("ไก่ผัดขิง");
        a15.setLmage((int)R.drawable.a15);
        a15.setName1("ส่วนผสม");
        a15.setData1("* เนื้อไก่หั่นชิ้นพอคำ 1 ถ้วย\n" +
                "* ขิงอ่อนหั่นเป็นฝอย 1 ถ้วย\n" +
                "* เห็ดหูหนูหั่นเป็นชิ้นเล็กๆ ครึ่งถ้วย\n" +
                "* เต้าเจี้ยว 2 ช้อนโต้ะ\n" +
                "* น้ำตาล 1 ช้อนโต๊ะ\n" +
                "* ซีอิ๊วขาว 1 ช้อนโต๊ะ\n" +
                "* พริกชี้ฟ้าหั่น 2 ช้อนโต้ะ\n" +
                "* หอมใหญ่หั่น 3 ช้อนโต๊ะ\n" +
                "* กระเทียมบด 1 ช้อนชา\n" +
                "* น้ำมันพืช 2 ช้อนโต้ะ\n" +
                "* ผงรสดี 1 ช้อนชา");
        a15.setName2("ขั้นตอนการทำ");
        a15.setData2("1.ตั้งกะทะน้ำมัน ร้อนปานกลาง นำไก่และกระเทียมลงไปผัด พอไก่สุก\n" +
                "2.ใส่ขิง เห็ดหูหนู หอมหัวใหญ่ และเต้าเจี้ยวลงไปผัด\n" +
                "3.ปรุงรสด้วย ผงรสดี น้ำตาล ซีอิ้วขาว และพริก ผัดจนเข้ากับ\n" +
                "4.เสริฟใส่จาน ทานกับข้าวสวย");

        a16 = new DataFood();
        a16.setName("หน่อไม้ฝรั่งผัดตับ");
        a16.setLmage((int)R.drawable.a16);
        a16.setName1("ส่วนผสม");
        a16.setData1("* ตับหมู หั่นเป็นชิ้นพอคำ 1 จาน\n" +
                "* หน่อไม้ฝรั่ง หั่นเป็นชิ้นพอคำ 1 จาน\n" +
                "* น้ำตาล 1 ช้อนโต้ะ\n" +
                "* ซอสถั่วเหลือง 1 ช้อนโต้ะ\n" +
                "* ซอสน้ำมันหอย 2 ช้อนโต้ะ\n" +
                "* น้ำมันพืช 2 ช้อนโต้ะ\n" +
                "* น้ำซุป 3 ช้อนโต้ะ");
        a16.setName2("ขั้นตอนการทำ");
        a16.setData2("1.นำ ตับหมู ไปลวก จากนั้นนำไปน็อคน้ำเย็น และพักไว้ก่อน\n" +
                "2.ตั้งกระทะน้ำมันให้ร้อน จากนั้น ใส่ ซอสถั่วเหลือง น้ำตาล และ ซอสน้ำมันหอย ผัดให้ส่วนผสมเข้ากัน จากนั้นใส่ หน่อไม่ฝรั่ง ลงไปผัด ใส่ น้ำซุป ลงไป ผัดให้ หน่อไม้ฝรั่ง เริ่มอ่อน\n" +
                "3.ใส่ ตับ ลงไปผัด ให้เข้ากับส่วนผสมทั้งหมด ก็สามารถเสริฟใส่จานรับประทานได้");

        a17 = new DataFood();
        a17.setName("ต้มยำขาหมู");
        a17.setLmage((int)R.drawable.a17);
        a17.setName1("ส่วนผสม");
        a17.setData1("* ขาหมูหรือตีนหมู 1 ถ้วย\n" +
                "* ตะไคร้หั่นเป็นท่อน 5-6 ชิ้น\n" +
                "* พริกสดโขรกพอหยาบๆ 1 ช้อนโต้ะ\n" +
                "* เห็ดฟางหั่น 1 กำมือ\n" +
                "* ใบมะกรูด 5-6 ใบ\n" +
                "* ข่าซอยเป็นชิ้น 5-6 ชิ้น\n" +
                "* น้ำมะขามเปียก 1 ช้อนโต้ะ\n" +
                "* น้ำปลา 3 ช้อนโต๊ะ\n" +
                "* น้ำมะนาว 2 ช้อนโต๊ะ\n" +
                "* ใบผักชีซอย 1 ช้อนชา\n" +
                "* น้ำเปล่า 1 หม้อ ขนาด 3 ลิตร");
        a17.setName2("ขั้นตอนการทำ");
        a17.setData2("1.ต้มน้ำให้เดือด จากนั้นใส่ ข่า ตะไคร้และใบมะกรูดลงไปต้ม\n" +
                "2.นำขาหมูลงไปต้มในหม้อ และรอจาขาหมูเริ่มนุ่ม\n" +
                "3.ใส่เห็ดฟางลงไปต้ม ปรุงรสด้วย น้ำปลา น้ำมะขามเปี๊ยก และพริก\n" +
                "4.เสริฟใส่ชามและเติมน้ำมะนาวเป็นขั้นตอนสุดท้าย และ โรยหน้าด้วยผักชี ");

        a18 = new DataFood();
        a18.setName("ไข่เจียวใส่ไข่มดแดง");
        a18.setLmage((int)R.drawable.a18);
        a18.setName1("ส่วนผสม");
        a18.setData1("* ไข่ไก่ 3 ฟอง\n" +
                "* ไข่มดแดง 1 ถ้วย\n" +
                "* ใบหอมหั่น 1 ช้อนโต้ะ\n" +
                "* มะเขือเทศหั่น 1 ผล\n" +
                "* น้ำปลา 1 ช้อนโต้ะ\n" +
                "* มันหอย 1 ช้อนโต้ะ\n" +
                "* น้ำมันพืช 4 ช้อนชา\n" +
                "* ซอสพริก 1 ถ้วยน้ำจิ้ม");
        a18.setName2("ขั้นตอนการทำ");
        a18.setData2("1.ตอกไข่ใส่ชาม ผสมกับ ไข่มดแดง ใบหอม มะเขือ น้ำปลา และ น้ำมันหอย ผสมให้เข้ากัน\n" +
                "2.ตั้งกระทะน้ำมันให้ร้อน ใช้ไฟอ่อน ใส่ไข่ลงไปทอด\n" +
                "3.ทอดให้เหลืองทั้งสองด้าน\n" +
                "4.เสริฟใส่จาน ทานกับ ซอสพริก และพริกน้ำปลา");

        a19 = new DataFood();
        a19.setName("ผัดเผ็ดปลาดุก");
        a19.setLmage((int)R.drawable.a19);
        a19.setName1("ส่วนผสม");
        a19.setData1(" * ปลาดุกสด หั่นชิ้น 1 ถ้วย\n" +
                "* กระเทียม บด 2 ช้อนโต๊ะ\n" +
                "* น้ำตาล 1 ช้อนโต๊ะ\n" +
                "* น้ำมันหอย 1 ช้อนโต้ะ\n" +
                "* พริกขี้หนูสวน บด 2 ช้อนโต๊ะ\n" +
                "* กระชาย หั่นฝอย 2 ช้อนโต้ะ\n" +
                "* ใบมะกรูด หั่น 2 ช้อนโต้ะ\n" +
                "* ใบโหระพา 3 ช้อนโต้ะ\n" +
                "* น้ำปลา 1 ช้อนโต๊ะ\n" +
                "* น้ำมันพืช สำหรับผัด 2 ช้อนโต๊ะ\n" +
                "* พริกไทยอ่อน 1 ช้อนโต้ะ");
        a19.setName2("ขั้นตอนการทำ");
        a19.setData2("1.ตั้งกระทะน้ำมันให้น้อน นำ ปลาดุก ลงไปผัดให้สุก\n" +
                "2.ใส่ กระเทียม พริก กระชาย และ พริกไทยอ่อน ลงไปผัด ปรุงรสด้วย น้ำปลา น้ำตาล และ น้ำมันหอย\n" +
                "3.ใส่ ใบมะกรูด และ ใบโหรพา ลงไปผัด เสริฟใส่จาน");

        a20 = new DataFood();
        a20.setName("ทอดมันหัวปลี");
        a20.setLmage((int)R.drawable.a20);
        a20.setName1("ส่วนผสม");
        a20.setData1("* หัวปลีของกล้วยน้ำหว้า ขนาดกลาง 1 หัว\n" +
                "* ข่าซอย 2 ช้อนโต้ะ\n" +
                "* ตะไคร้ซอย 2 ช้อนโต้ะ\n" +
                "* ผิวมะกรูด 1 ช้อนโต้ะ\n" +
                "* พริกแห้ง 2 ช้อนโต้ะ\n" +
                "* กระเทียม 2 ช้อนโต้ะ\n" +
                "* หอมแดง 2 ช้อนโต้ะ\n" +
                "* เกลือ 1 ช้อนชา\n" +
                "* ไข่ไก่ 2 ฟอง\n" +
                "* หมูสับ 3 ขีด\n" +
                "* แป้งสาลี 2 ช้อนโต้ะ\n" +
                "* น้ำปลา 2 ช้อนโต้ะ\n" +
                "* น้ำมันสำหรับทอด");
        a20.setName2("ขั้นตอนการทำ");
        a20.setData2("1.ทำพริกแกงแดง ด้วยการ นำ ข่า ตะไคร้ ผิวมะกรูด พริกแห้ง หอมแดง กระเทียม เกลือ โขรกให้ส่วนผสมทั้งหมดละเอียดเป็นเนื้อเดียวกัน จากนั้นนำมาพักเอาว้ก่อน เตรียมนำมาทำทอดมัน\n" +
                "2.เตรียมหัวปลี โดย ตัดหัวออก ผ่าไส้หัวปลีออก ล้างด้วยน้ำมะนาว เอาเฉพาะส่วนกาบอ่อน นำมาหั่นและสับให้เป็นชิ้นพอดีคำ ไม่ใหญ่ หรือ ละเอียดเกินไป\n" +
                "3.ผสมทอดมัน โดย นำ พริกแกงแดง หมูสับ กาบหัวปลี น้ำปลา ใบมะกรูดซอย แป้งสาลี ไข่ไก่ นวดให้ส่วนผสมเป็นเหนียวสามารถปั้นเป็นก้อนได้\n" +
                "4.ตั้งกระทะน้ำมันให้น้ำมันร้อน ไฟปานกลาง ปั้นทอดมันให้ได้ขนาดพอดีคำ เป็นชิ้นลักษณะแบน นำลงไปทอด ให้เหลืองสุก ก็สามารถเสริฟรับประทานได้ ");

        a21 = new DataFood();
        a21.setName("แกงขนุนใส่ซี่โครง");
        a21.setLmage((int)R.drawable.a21);
        a21.setName1("ส่วนผสม");
        a21.setData1("* ซี่โครงหมูอ่อน 1 ถ้วย\n" +
                "* เนื้อขนุนอ่อน หั่นเป็นชิ้น 1 ถ้วย\n" +
                "* ยอดชะอมอ่อน ครึ่งถ้วย\n" +
                "* มะเขือเทศ ผ่าครึ่ง ครึ่งถ้วย\n" +
                "* ผักชีฝรั่งซอยหยาบ 5 ช้อนโต้ะ\n" +
                "* ใบชะพลูซอย 5 ช้อนโต้ะ\n" +
                "* พริกแห้ง 4 เม็ด\n" +
                "* หอมแดง 3 หัว\n" +
                "* กระเทียม 2 หัว\n" +
                "* กะปิ 3 ช้อนชา\n" +
                "* ปลาร้าสับ 2 ช้อนชา\n" +
                "* น้ำเปล่า 2 ถ้วย");
        a21.setName2("ขั้นตอนการทำ");
        a21.setData2("1.เตรียมเครื่องแกงโดย โขลก พริกแห้ง หอมแดง กระเทียม กะปิ และ ปลาร้า ให้ละเอียดเป็นเนื้อเดียวกัน\n" +
                "2.ต้มน้ำให้เดือน นำเครื่องแกงลงไปต้ม และใส่ซี่โครงหมูลงไปให้สุก\n" +
                "3.ใส่มะเขือลงไป ผักชีฝรั่ง ยอดชะอม และใบชะพลู ต้มจนสุกและเสริฟใส่ชามพร้อมรับประทาน กับข้าวง่ายๆ\n" +
                "4.ขนุน ชาวเหนือ เรียกว่า บะหนุน หรือ บ่าหนุน ซึ่งขนุนสามารรับประทานได้ตั้งแต่ ยอดอ่อน โดยใบอ่อน ของขนุนสามรถนำมาทำเป็นผักสด\n" +
                " จิ้มน้ำพริก สำหรับ แกงขนุน จะใช้ ลูกขนุนอ่อน ซึ่งสามารถนำมาทำแกงขนุนใส่ซี่โครงหมู เป็น สูตรอาหาร เมนูหมู กับ น้ำพริกแกง และ มะเขือส้ม\n" +
                " ใช้ขนุนอ่อน ต้มพอสุก นำซี่โครงหมูคลุกกับพริกสดโขลกกับข้าวเบือพอแหลก ใส่น้ำใบย่านาง น้ำปลาร้า น้ำปลา เกลือ ตั้งไฟพอเดือด ใส่ขนุน บวบ ชะอม ใบแมงลัก");

        a22 = new  DataFood();
        a22.setName("ผัดเผ็ดเนื้อใบยี้หร่า");
        a22.setLmage((int)R.drawable.a22);
        a22.setName1("ส่วนผสม");
        a22.setData1("* เครื่องเทศ ประกอบด้วย ใบกระวานแห้ง เม็ดลูกผักชี และเม็ดยี่หร่า ในอัตราส่วนเท่ากัน\n" +
                "* พริกแกงเผ็ด 2 ช้อนโต้ะ\n" +
                "* น้ำปลา 2 ช้อนโต้ะ\n" +
                "* น้ำตาลทราย 1 ช้อนชา\n" +
                "* ใบยีหร่าซอยหยาบๆ 1 กำมือ\n" +
                "* เนื้อวัวสับ หยาบๆ 1 จาน\n" +
                "* พริกสด ซอย เฉียงยาวๆ 2 ช้อนโต้ะ");
        a22.setName2("ขั้นตอนการทำ");
        a22.setData2("1.เตรียมเครื่องเทศ โดย นำใบกระวาน เม็ดลูกผักชี และเม็ดยี่หร่า ไปคั่วให้หอม และนำมาโขรกให้ละเอียดเป็นเนื้อเดียวกัน จากนั้นนำมาพักเอาไว้ก่อน\n" +
                "2.ต้มน้ำให้เดือดจัด จากนั้นนำเนื้อวัวไปลวกให้พอสุก ไม่สุกมาก จากนั้นนำมาพักไว้ก่อน\n" +
                "3.ตั้งกระทะน้ำมันให้ร้อน ไฟอ่อนๆ นำพริกแกงเผ็ดลงไปผัด ให้หอมสุกจากนั้นใส่เครื่องเทศลงไปผัด 1 ช้อนโต้ะ\n" +
                "4.นำเนื้อวัวลวกลงไปผัด ปรุงรสด้วย น้ำปลาและน้ำตาล\n" +
                "5.เติมใบยี้หร่าซอยลงไปผัด พอสุก สามารถเสริฟใส่จานพร้อมรับประทานได้");

        a23 = new  DataFood();
        a23.setName("กระเจี๊ยบผัดเกลือ");
        a23.setLmage((int)R.drawable.a23);
        a23.setName1("ส่วนผสม");
        a23.setData1("* กระเจี๊ยบเขียว หั่นเป็นชิ้นพอคำ 1 จาน\n" +
                "* ข้าวสวย 1 ทัพพี\n" +
                "* เกลือ 1 ช้อนโต้ะ\n" +
                "* พริกไทยป่น 1 ช้อนโต้ะ\n" +
                "* กระเทียมบด 1 ช้อนชา\n" +
                "* น้ำมันสำหรับทอด");
        a23.setName2("ขั้นตอนการทำ");
        a23.setData2("1.ตั้งกระทะน้ำมันให้ร้อน นำข้าวสวยลงไปทอด ให้เหลืองกรอบ จากนั้นตักน้ำมันออกให้แห้ง\n" +
                "2.บี้ข้าวสวยทอด ให้แตก นำกระเจี๊ยบลงไปผัด\n" +
                "3.ปรุงรสด้วย เกลือ พริกไทย และกระเทียมบด ผัดต่อ จนกระเจี๊ยบสุก ก็สามารถนำมาพัก\n" +
                "4.เสริฟ เมนูกระเจี๊ยบผัดเกลือ ร้อนๆ ทานกับข้าวสวย");

        a24 = new  DataFood();
        a24.setName("ไก่นึ่งสมุนไพร");
        a24.setLmage((int)R.drawable.a24);
        a24.setName1("ส่วนผสม");
        a24.setData1("* ไก่ ครึ่งตัว\n" +
                "* หอมแดง 4 หัว\n" +
                "* กระเทียม 4-5 กลีบ\n" +
                "* รากผักชี 2 ต้น\n" +
                "* ข่าหั่นแว่น 3-4 ชิ้น\n" +
                "* ตะไคร้ หั่นหยาบ 1 ต้น\n" +
                "* เกลือ 1 ช้อนชา\n" +
                "* น้ำตาล ครึ่ง ช้อนชา\n" +
                "* ใบมะกรูด 2 ใบ");
        a24.setName2("ขั้นตอนการทำ");
        a24.setData2("1.โขรก หอมแดง กระเทียม รากผักชี ข่า ตะไคร้ ให้ละเอียดเข้ากัน จากนั้น ผสมกับ ใบมะกรูดฉีก เกลือและน้ำตาล\n" +
                "2.นำส่วนผสมทั้งหมดมาหมักไก่ สัก 30 นาที\n" +
                "3.นำไก่ที่หมักลงไปนึ่ง 30 – 45 นาที สังเกตุให้ไก่สุก เสริฟใส่จาน ");

        a25 = new DataFood();
        a25.setName("น้ำพริกแมลงดา");
        a25.setLmage((int)R.drawable.a25);
        a25.setName1("ส่วนนผสม");
        a25.setData1("* กะปิ 1 ช้อนโต้ะ\n" +
                "* แมงดานา 1 ตัว\n" +
                "* กระเทียม 1 หัว\n" +
                "* พริกสด 10 เม็ด\n" +
                "* มะอึก 1 ผล\n" +
                "* น้ำปลา\n" +
                "* น้ำมะนาว\n" +
                "* น้ำตาลปี๊บ\n" +
                "* ผักสด");
        a25.setName2("ขั้นตอนการทำ");
        a25.setData2("1.นำมะอึกมาขูดผิวและล้างน้ำให้สะอาห\n" +
                "2.นำกะปิ ห่อใบตอง ปิ้งให้สุก พร้อมกับปิ้ง พริก กระเทียม และ แมงดานา ให้สุก\n" +
                "3.โขรก กะปิ พริก กระเทียม แมงดานา และ มะอึก ให้ละเอียด\n" +
                "4.จากนั้นปรุงรสด้วย น้ำปลา น้ำตาล และ น้ำมะนาว ตามใจชอบ ทานกับ ผักสด");

        a26 = new DataFood();
        a26.setName("ยำไข่มดแดง");
        a26.setLmage((int)R.drawable.a26);
        a26.setName1("ส่วนผสม");
        a26.setData1("* ไข่มดแดง 1 ถ้วย\n" +
                "* น้ำปลา 1 ช้อนโต๊ะ\n" +
                "* มะนาว ครึ่งช้อนโต๊ะ\n" +
                "* หอมแดงซอย\n" +
                "* พริกป่นหรือพริกขี้หนูซอย 1 ช้อนโต๊ะ\n" +
                "* ข้าวคั่ว 1 ช้อนโต๊ะ\n" +
                "* ต้นหอมซอย\n" +
                "* สะระแหน่ สำหรับตกแต่งจาน");
        a26.setName2("ขั้นตอนการทำ");
        a26.setData2("1.ล้างไข่มดแดงให้สะอาด สะเด็ดน้ำออกให้หมด พักใส่ชามไว้\n" +
                "2.ทำน้ำยำแยกไว้ก่อน โดยใส่น้ำปลา น้ำมะนาว พริกป่น ข้าวคั่ว หอมแดง และต้นหอม คลุกเคล้าให้ทุกอย่างเข้ากัน\n" +
                "3.จากนั้นก็ใส่ไข่มดแดงลงไป คลุกเคล้าอย่างเบามือ\n" +
                "4.ตักใส่จาน โรยด้วยใบสะระแหน่ พร้อมเสริฟ");


        a27 = new DataFood();
        a27.setName("ตับหวาน");
        a27.setLmage((int)R.drawable.a27);
        a27.setName1("ส่วนผสม");
        a27.setData1("* ตับหมูหั่น 1 ถ้วย\n" +
                "* ข้าวคั่ว 1 ช้อนโต๊ะ\n" +
                "* พริกป่น 1 ช้อนโต๊ะ\n" +
                "* น้ำมะนาว 2 ช้อนโต๊ะ\n" +
                "* น้ำปลา 1 ช้อนโต๊ะ\n" +
                "* น้ำตาล 1 ช้อนชา\n" +
                "* ต้นหอมซอย 1 ช้อนโต๊ะ\n" +
                "* ใบสาระแหน่ 2 ช้อนโต้ะ\n" +
                "* หอมแดงซอย 3 ช้อนโต้ะ");
        a27.setName2("ขั้นตอนการทำ");
        a27.setData2("1.เริ่มจากการลวกตับหมูก่อน ตั้งน้ำต้มให้เดือด นำตับหมูลงไปลวก ให้สุก แต่อย่าลวกสุกเกินไป ตับจะแข็งไม่น่ารับประทาน จากนั้น ก็ปรุงรสโดย\n" +
                "2.เตรียมหม้อสำหรับยำ โดย ใส่ ตับหมูลวก น้ำตาล น้ำปลา น้ำมะนาว พริกป่น ข้าวคั้ว ต้นหอม หอมแดง และ ใบสาระแหน่ คลุกส่วนผสมให้เข้ากัน เพียงเท่านี้ก็ได้ ลาบตับหมูแสนอร่อย\n" +
                "3.เสริฟ ตับหวาน กับผักสดๆ เช่น แตงกวา มะเขือเปาะ และ ผักกะหล่ำปลี ทานกับ ข้าวเหนียวนุ่มๆ ส้มตำ ไก่ย่าง และ แกงแบบอีสานสักจาน");


        a28 = new DataFood();
        a28.setName("ปลาดุกผัดพริกหยวก");
        a28.setLmage((int)R.drawable.a28);
        a28.setName1("ส่วนผสม");
        a28.setData1("* ปลาดุก หั่นเป็นชิ้น 1 ถ้วย\n" +
                "* พริกแกงเผ็ด 2 ช้อนโต้ะ\n" +
                "* พริกหยวก หั่น 3 ช้อนโต้ะ\n" +
                "* ใบมะกรูด หั่นฝอย 1 ช้อนโต้ะ\n" +
                "* ใบโหระพา 2 ช้อนโต้ะ\n" +
                "* หัวกะทิ 2 ถ้วย\n" +
                "* น้ำเปล่า ครึ่ง ถ้วย\n" +
                "* กระชาย หั่นเป็นฝอย ครึ่งถ้วย\n" +
                "* น้ำตาล 1 ช้อนโต้ะ\n" +
                "* น้ำปลา 2 ช้อนโต้ะ\n" +
                "* น้ำมันพืช สำรับผัด 2 ช้อนโต้ะ");
        a28.setName2("ขั้นตอนการทำ");
        a28.setData2("1.ขั้นตอนการทำขั้นแรก ต้องผัดพริกแกงเผ็ดก่อน โดยตั้งกระทะน้ำมัน โดยใช้ไฟอ่อนๆ นำ พริกแกงเผ็ด ลงไปผัดให้สุก " +
                "  การสังเกตุว่าสุกให้สังเกตุจากกลิ่นหอมของพริกแกงจะขึ้นมา เมื่อพริกแกงสุกได้ที่จึงใส่ หัวกะทิ ลงไปต้ม เติมน้ำเปล่าลงไปนิดหน่อย ต้มต่อให้หัวกะทิแตกมัน\n" +
                "2.เมื่อหัวกะทิเริ่มแตกมันแล้ว ให้ใส่ ใบมะกรูด พริกหยวก และ กระชาย ลงไป จากนั้นปรุงรสด้วย น้ำปลา และ น้ำตาล ชิมรสชาติให้ได้ที่\n" +
                "3.ต่อมาใส่เนื้อปลาดุกลงไปต้ม โดยขั้นตอนนี้ให้ใ่สปลาลงไปต้ม ไม่ต้องกวนน้ำเลย ปล่อยให้เนื้อปลาสุกเอง เนืแงจากปลาสุกง่าย หากกวนจะทำให้เนื้อปลาเละ ไม่น่ารับประทาน\n" +
                "4.เมื่อปลาสุก ก็เสริฟใส่ชาม โรยหน้าด้วย ใบโหระพา พร้อมสำหรับรับประทาน ทานคู่กับข้าวสวยร้อนๆ แสนอร่อย");


        a29 = new DataFood();
        a29.setName("เสือร้องไห้");
        a29.setLmage((int)R.drawable.a29);
        a29.setName1("ส่วนผสม");
        a29.setData1("* เนื้อวัวหั่นเป็นชิ้น 500 กรัม\n" +
                "* ซิอิ๊วขาว 2 ช้อนโต๊ะ\n" +
                "* พริกไทย 1 ช้อนชา\n" +
                "* น้ำปลา 1 ช้อนโต้ะ\n" +
                "* น้ำมันหอย 1 ช้อนโต้ะ\n" +
                "* น้ำปลา 2 ช้อนโต้ะ(น้ำจิ้ม)\n" +
                "* น้ำมะนาว 3 ช้อนโต้ะ\n" +
                "* หอมแดงซอย 2 ช้อนโต้ะ\n" +
                "* ผักชีซอย 1 ช้อนชา\n" +
                "* ข้าวคั่ว 2 ช้อนชา\n" +
                "* พริกแห้งป่น 1 ช้อนโต้ะ");
        a29.setName2("ขั้นตอนการทำ");
        a29.setData2("1.เตรียมชาม ใส่เนื้อหมักเนื้อ ด้วยพริกไทย ซิอิ๊ว น้ำมันหอย และน้ำปลา หมักไว้ครึ่งวันเป้นย่างน้อน\n" +
                "2.เตรียมเตาย่าง นำไปย่างจนสุก จากนั้น หั่นเนื้อเป็นชิ้นๆพอคำ\n" +
                "3.เตรียมน้ำจิ้ม โดยผสม น้ำปลา น้ำมะนาว หอมแดง ข้าวคั่ว ผักชี และพริกแห้งป่น ผสมกันให้เข้ากัน\n" +
                "4.เสริฟ เนื้อย่างพร้อมกับน้ำจิ้มแจ่ว ");


        a30 = new DataFood();
        a30.setName("ลาบเป็ด");
        a30.setLmage((int)R.drawable.a30);
        a30.setName1("ส่วนผสม");
        a30.setData1("* เนื้อเป็ดหั่นเป็นชิ้น 1 จาน\n" +
                "* หนังเป็ด หั่นเป็นชิ้น 1 จาน\n" +
                "* กระเทียมโขรก 1 จาน\n" +
                "* ข้าวคั่ว 1 ช้อนโต้ะ\n" +
                "* น้ำซุปเป็ด 5 ช้อนโต้ะ\n" +
                "* น้ำปลา 1 ช้อนโต้ะ\n" +
                "* น้ำมะนาว 1 ช้อนโต้ะ\n" +
                "* พริกป่น 1 ช้อนโต้ะ\n" +
                "* ต้นหอมซอย 1 ช้อนโต้ะ\n" +
                "* หอมแดงซอย 1 ช้อนโต้ะ\n" +
                "* ผักชีฝรั่งซอย 1 ช้อนโต้ะ\n" +
                "* ใบสะระเหน่ 2-3 ใบ");
        a30.setName2("ขั้นตอนการทำ");
        a30.setData2("1.เตรียมหนังเป็ดเจียว ด้วยการ คั่วหนังเป็ดให้แห้งเหลืองกรอบ จากนั้น เอาหนังเป็ดมาพักให้สะเด็ดน้ำมัน\n" +
                "2.ใช้น้ำมันจากหนังเป็ด มาเจียวกรเทียม ให้เหลืองกรอบ\n" +
                "3.นำหนังเป็ดมาผสมกับกระเทียมเจียว จะได้หนักเป็นเจียว\n" +
                "4.เตรียมข้าวคั่ว โดยใช้ข้าวเหนียว ตะไคร้ซอย และข่าซอย มาคั่วให้หอม\n" +
                "5.จากนั้นนำงาขาวมาคั่ว นำข้าวคั่ว 4 ส่วน ต่อ งาขาวตั่ว 1 ส่วน ผสมกัน โขรกให้ละเอียด จะได้ข้าวคั่วสำหรับเมนูลาบเป็ด\n" +
                "6.ตั้งกระทะ ใส่น้ำซุป เอาเนื้อเป็ดลงไปต้ม ให้สุก ใส่ ข้าวคั่ว พริกป่น น้ำปลา น้ำมะนาว ผสมให้เข้ากัน ชิมรส\n" +
                "7.ใส่ผัก อย่าง ต้นหอม ผักชีฝรั่ง หอมแดง ลงไปผสม คลุดเคล้า เสริฟใส่จาน");


        a31 = new DataFood();
        a31.setName("แกงพะแนงหมู");
        a31.setLmage((int)R.drawable.a31);
        a31.setName1("ส่วนผสม");
        a31.setData1("* เนื้อหมู 400 กรัม (หั่นเป็นชิ้นพอดีคำ)\n" +
                "* น้ำพริกแกงพะแนง 2 ช้อนโต๊ะ\n" +
                "* น้ำมันพืช 2 ช้อนโต๊ะ\n" +
                "* กะทิ 150 กรัม\n" +
                "* น้ำตาลปี๊บ 2 ช้อนโต๊ะ\n" +
                "* น้ำปลา 2 ช้อนโต๊ะ\n" +
                "* ใบโหระพา 10 ใบ\n" +
                "* พริกชี้ฟ้า 2 เม็ด (หั่นตามแนวขวาง)\n" +
                "* ใบมะกรูด 3 ใบ (ซอยละเอียด)");
        a31.setName2("ขั้นตอนการทำ");
        a31.setData2("1.นำเครื่องแกงไปผัดกับน้ำมันประมาณ 1 นาที จากนั้นจึงใส่กระทิลงไปและต้มต่อไปจนเดือด\n" +
                "2.ใส่เนื้อหมู แล้วจึงปรุงรสด้วยน้ำตาลและน้ำปลา\n" +
                "3.เมื่อเนื้อหมูสุกดีแล้ว จึงใส่ใบโหระพา, พริกและใบมะกรูด คนต่อไปอีกสักพัก ตักใส่ถ้วยและเสิรฟพร้อมข้าวสวยร้อนๆ");


        a32 = new DataFood();
        a32.setName("แกงเขียวหวานไก่");
        a32.setLmage((int)R.drawable.a32);
        a32.setName1("ส่วนผสม");
        a32.setData1("* น้ำพริกแกงเขียวหวาน 1/4 ถ้วยตวง\n" +
                "* เนื้อไก่ 350 กรัม (หั่นเป็นชิ้นเล็ก พอดีคำ)\n" +
                "* กะทิ 1 1/4 ถ้วยตวง\n" +
                "* ใบโหระพา 1/4 ถ้วยตวง\n" +
                "* มะเขือเปราะ 2 ลูก (หั่นเป็นชิ้นเล็กๆ)\n" +
                "* น้ำซุปไก่ 1/2 ถ้วยตวง\n" +
                "* น้ำตาลมะพร้าว 2 ช้อนโต๊ะ (หรือน้ำตาลทรายธรรมดา)\n" +
                "* น้ำปลา 3 ช้อนโต๊ะ\n" +
                "* พริกชี้ฟ้าแดง 2 เม็ด (หั่นเฉียง)\n" +
                "* ใบมะกรูด 4 ใบ");
        a32.setName2("ขั้นตอนการทำ");
        a32.setData2("1.ตั้งกะทิ 1/2 ถ้วยตวง (กระทิส่วนที่เหลือไว้ค่อยใช้ในขั้นตอนต่อไป) บนกระทะจนร้อน (ใช้ไฟปานกลาง) คนจนกระทิเดือดประมาณ 3 - 5 นาที\n" +
                "  จากนั้นใส่เครื่องแกงเขียวหวานลงไปผัดกับกระทิสักพักจนน้ำกระทิงวดลง จึงเทส่วนผสมทั้งหมดลงในหม้อใหญ่\n" +
                "2.นำหม้อใบใหญ่ตั้งไฟปานกลาง ใส่เนื้อไก่และคนประมาณ 2 นาที จากนั้นใส่น้ำปลา, น้ำตาล คนต่อไปอีก 1 นาที\n" +
                "  ใส่มะเขือเปราะที่หั่นไว้แล้ว ใส่น้ำกระทิที่เหลือและใส่น้ำซุปไก่ ต้มต่อไปสักพักจนเนื้อไก่เริ่มสุก และมะเขือเปราะนิ่ม\n" +
                "3.ใส่ใบมะกรูดและใบโหระพา รอจนเดือด จากนั้นจึงปิดไฟ ตักใส่ถ้วยเสิรฟพร้อมกับข้าวสวยร้อนๆ ");


        a33 = new DataFood();
        a33.setName("ลาบพวงไข่");
        a33.setLmage((int)R.drawable.a33);
        a33.setName1("ส่วนผสม");
        a33.setData1("* พวงไข่ไก่ 1 ถ้วย\n" +
                "* ใบสาระแหน่ 1 ช้อนโต๊ะ\n" +
                "* น้ำมะนาว 2 ช้อนโต๊ะน้ำปลา 2 ช้อนโต๊ะ\n" +
                "* ข้าวคั่ว 2 ช้อนโต๊ะ\n" +
                "* ใบหอม ซอย 1 ช้อนโต๊ะ\n" +
                "* ผักชีฝรั่ง ซอย 1 ช้อนโต๊ะ\n" +
                "* พริกป่น 1 ช้อนโต๊ะ\n" +
                "* น้ำตาลทราย 1 ช้อนชา\n" +
                "* หอมแดง ซอย 3 ช้อนโต้ะ");
        a33.setName2("ขั้นตอนการทำ");
        a33.setData2("1.นำ พวงไข่ไก่ มาล้างให้สะอาด จากนั้นนำ พวงไข่ไก่ ไปต้มให้สุก นำ พวงไข่ไก่ต้ม หั่นครึ่ง นำพวงไข่ไก่ จัดใส่จาน เตรียมทำน้ำลาบ เพื่อราดบน\n" +
                "2.ทำน้ำลาบ ด้วยการใส่ น้ำมะนาว น้ำปลา น้ำตาล พริกป่น และ ข้าวคั่ว ผสมให้ส่วนผสมละลายเข้ากัน\n" +
                "3.ใส่ ต้นหอม ใบสะระแหน่ ผักชีฝรั่ง ผสมใน น้ำลาบ\n" +
                "4.ราดน้ำลาบบน พวงไข่ไก่ต้ม จัดจานให้สวยงาม พร้อมรับประทาน ");


        a34 = new DataFood();
        a34.setName("ทอดมันปลา");
        a34.setLmage((int)R.drawable.a34);
        a34.setName1("ส่วนผสม");
        a34.setData1("* เนื้อปลาสับหรือบด 500 กรัม\n" +
                "* ไข่ไก่ 1 ฟอง\n" +
                "* ถั่วฝักยาว 1/2 ถ้วยตวง (หั่นเป็นชิ้นบาง)\n" +
                "* ใบมะกรูดซอยละเอียด 3 ช้อนโต๊ะ\n" +
                "* น้ำตาล 1 ช้อนชา\n" +
                "* เกลือ 1 ช้อนชา\n" +
                "* น้ำพริกแกงเผ็ด 1 ช้อนโต๊ะ\n" +
                "* แตงกวาหั่นเป็นชิ้นเล็ก 1 ถ้วยตวง\n" +
                "* ถั่วลิสงคั่วแล้วนำไปบด 1/2 ถ้วยตวง\n" +
                "* น้ำตาล 1/2 ถ้วยตวง\n" +
                "* น้ำส้มสายชู 1/2 ถ้วยตวง");
        a34.setName2("ขั้นตอนการทำ");
        a34.setData2("\n" +
                "1.นำส่วนผสมทอดมันทั้งหมดลงในชามขนาดใหญ่ นวดด้วยมือจนส่วนผสมทั้งหมดเคล้ากันทั่ว\n" +
                "2.นำช้อนตักส่วนผสมออกมา 2 ช้อนโต๊ะ และปั้นเป็นแผ่นกลม (เส้นผ่าศูนย์กลางประมาณ 3 นิ้ว) ปั้่นจนส่วนผสมหมด แล้วจึงจากนั้นจึงนำไปทอดในน้ำมันที่ร้อนปานกลาง จนกระทั่งสุก\n" +
                "3.เสิรฟพร้อมน้ำจิ้มแตงกวา\n" +
                "4.ผสมน้ำตาลกับน้ำส้มสายชูลงในหม้อเล็ก และนำไปตั้งบนไฟอ่อนๆ\n" +
                "5.เมื่อน้ำตาลละลายแล้ว จึงปิดไฟและทิ้งไว้ให้เย็น\n" +
                "6. ตักใส่ถ้วยน้ำจิ้ม ใส่แตงกวาและถั่วลิสงบด");


        a35 = new DataFood();
        a35.setName("หมูพะโล้");
        a35.setLmage((int)R.drawable.a35);
        a35.setName1("ส่วนผสม");
        a35.setData1("* เนื้อหมูติดมัน 400 กรัม (หั่นขนาดยาว 2\" และหนา 1 \")\n" +
                "* ไข่ไก่ 3 ฟอง\n" +
                "* ผักชี 3 ต้น\n" +
                "* ซิอิ๊วขาว 3 ช้อนโต๊ะ\n" +
                "* ซิอิ๊วดำ 1 ช้อนโต๊ะ\n" +
                "* น้ำตาล 4 ช้อนโต๊ะ\n" +
                "* ผงพะโล้ 1/2 ช้อนโต๊ะ\n" +
                "* กระเทียมทุบ 3 กลีบ\n" +
                "* พริกไทยเม็ด 1 ช้อนชา\n" +
                "* น้ำมันพืช 1 ช้อนโต๊ะ\n" +
                "* น้ำเปล่า 3 ถ้วยตวง\n" +
                "* ผักชีสำหรับแต่งอาหาร");
        a35.setName2("ขั้นตอนการทำ");
        a35.setData2("1.ต้มน้ำในหม้อ รอจนน้ำเดือดจึงใส่ไข่ลงไปต้มจนสุก นำไข่ออกมาปอกเปลือกเตรียมไว้\n" +
                "2.ใส่น้ำมันในกระทะและนำไปตั้งไฟ ใส่กระเทียมและพริกไทยลงไปผัดจนหอม จากนั้นเติมหมูลงไปผัดจนเกือบสุก\n" +
                "3.ใส่ผงพะโล้, ซิอิ๊วดำ, ซิอิ๊วขาว, ไข่ต้ม, น้ำตาลและน้ำลงไป ต้มด้วยไฟอ่อนๆประมาณ 30 นาที จึงปิดไฟ\n" +
                "4.ตักใส่ถ้วย แต่งหน้าด้วยผักชี เสริฟทันทีพร้อมข้าวสวยร้อนๆ\n");


        a36 = new DataFood();
        a36.setName("ต้มยำปลาช่อนใบมะขาม");
        a36.setLmage((int)R.drawable.a36);
        a36.setName1("ส่วนผสม");
        a36.setData1("* ปลาช่อนหั่นเป็นชิ้นพอคำ 1 ถ้วย\n" +
                "* เครื่องต้มยำ (ข่า ตะไคร้ ใบมะกรูด)\n" +
                "* หอมแดงบุ 3 หัว\n" +
                "* เห็ดฟางหั้นพอคำ 1 ถ้วย\n" +
                "* มะเขือเทศหั่นพอคำ 1 ลูก\n" +
                "* พริกทอด 3 เม็ด\n" +
                "* น้ำปลา 3 ช้อนโต้ะ\n" +
                "* น้ำมะนาว 3 ช้อนโต้ะ\n" +
                "* น้ำมะขามเปียก 1 ช้อนโต้ะ\n" +
                "* ผักชีฝรั่งหั่นพอคำ 2 ช้อนโต้ะ\n" +
                "* ใบมะขามอ่อน 2 ช้อนโต้ะ");
        a36.setName2("ขั้นตอนการทำ");
        a36.setData2("1.ต้มน้ำให้เดือด จากนั้นให้ผ่อนไฟให้อ่อนลง นำ ข่า ตะไคร้ และใบมะกรูดลงไปต้ม\n" +
                "2.เมื่อเริ่มหอมน้ำมันละเหยก็ให้ใส่ เห็ดฟาง หอมแดงและใบมะขามอ่อนลงไป\n" +
                "3.ปรุงรสด้วย น้ำปลา และน้ำมะขามเปียก\n" +
                "4.เร่งไฟให้เดือด ใส่เนื้อปลาช่อนลงไปต้ม รอให้ปลาสุก จากนั้นผ่อนไฟลงปานกลาง\n" +
                "5.ใส่มะเขือ พริกแห้งและผักชีฝรั่งลงไป\n" +
                "6.ปิดไฟ และใส่น้ำมะนาวปรุงรสขั้นตอนสุดท้าย");


        a37 = new DataFood();
        a37.setName("ลาบหมู");
        a37.setLmage((int)R.drawable.a37);
        a37.setName1("ส่วนผสม");
        a37.setData1("* เนื้อหมูสับ 1 ถ้วย\n" +
                "* หนังหมูหั่น 3 ช้อนโต้ะ\n" +
                "* ตับหมูหั่น 3 ช้อนโต้ะ\n" +
                "* ไส้อ่อนหั่น 3 ช้อนโต๊ะ\n" +
                "* ใบสาระแหน่ 1 ช้อนโต๊ะ\n" +
                "* น้ำมะนาว 2 ช้อนโต๊ะ\n" +
                "* น้ำปลา 2 ช้อนโต๊ะ\n" +
                "* ข้าวคั่ว 2 ช้อนโต๊ะ\n" +
                "* ใบหอมซอย 1 ช้อนโต๊ะ\n" +
                "* ผักชีฝรั่งซอย 1 ช้อนโต๊ะ\n" +
                "* พริกแห้งบด 1 ช้อนโต๊ะ\n" +
                "* น้ำตาล 1 ช้อนชา\n" +
                "* หอมแดงซอย 3 ช้อนโต้ะ");
        a37.setName2("ขั้นตอนการทำ");
        a37.setData2("1.ต้ม หมูสับ หนังหมู และ ตับหมู ให้สุก จากนั้น นำเนื้อหมูสับที่ หนังหมู และ ตับหมู ที่ต้มสุกแล้ว พักใส่ชาม\n" +
                "2.ปรุงรสลาบด้วย น้ำปลา น้ำตาล มะนาว ข้าวคั่ว ใบหอม ผักชีฝรั่ง พริกแห้งบด ใบสาระแหน่\n" +
                "   และ หอมแดงซอย ผสมกับหมูสับ หนังหมู และ ตับหมู ให้เข้ากัน\n" +
                "3.เสริฟใช่จาน ทานกับ ข้าวเหนียว และ ผักสดๆ");


        a38 = new DataFood();
        a38.setName("หมูกอร์ดองเบลอ");
        a38.setLmage((int)R.drawable.a38);
        a38.setName1("ส่วนผสม");
        a38.setData1("* หมูสันนอก หั่นเป็นชิ้น น้ำหนักชิ้นละ 100-120 กรัม จำนวน 2 ชิ้น\n" +
                "* เกลือป่น และพริกไทยป่น\n" +
                "* ไข่ไก่ 1 ฟอง (ตีจนเข้ากัน)\n" +
                "* แป้งสาลีอเนกประสงค์\n" +
                "* เกล็ดขนมปัง\n" +
                "* แฮม 1 แผ่น\n" +
                "* เชดด้าชีส \n" +
                "* น้ำมันสำหรับทอด\n" +
                "* ไม้จิ้มฟัน");
        a38.setName2("ขั้นตอนการทำ");
        a38.setData2("1. นำหมูสันนอกหั่นตามขวางแบบสเต๊ก หนา 1.5-2 ซม. (จะใช้ค้อนทุบสเต๊กทุบเพิ่มความนุ่ม )\n" +
                "2. นำสันนอกสเต๊กที่หั่นแล้ว ใช้มีดคม ๆ แล่แผ่ออกเป็นปีกผีเสื้อ สำหรับใส่ชีสและแฮม จากนั้นนำชีสและแฮมหั่นตามขนาดของชิ้นหมู\n" +
                " วางใส่ลงไปตรงกลางบริเวณที่เราแล่ออก และปิดทับ โดยใช้ไม้จิ้มฟันกลัดหัวท้ายและตรงกลางเพื่อไม่ให้ชีสเยิ้มออกมาขณะทอด\n" +
                "3. โรยเกลือป่น และพริกไทยป่น เล็กน้อยทั้งสองด้าน \n" +
                "4. นำไปคลุกแป้งสาลีให้ทั่วบาง ๆ รอบชิ้นหมู แล้วนำไปชุบไข่ ตามด้วยชุบเกล็ดขนมปังทั้งสองด้าน\n" +
                "5. ทอดในน้ำมันร้อนไฟปานกลาง จนสุกเหลืองน่ารับประทาน ตักขึ้นสะเด็ดน้ำมันในแนวตั้ง (ทิ้งไว้สัก 2-3 นาที ให้ชีสเซตตัว)");


        a39 = new DataFood();
        a39.setName("เห็ดฟางผัดใบโหระพา");
        a39.setLmage((int)R.drawable.a39);
        a39.setName1("ส่วนผสม");
        a39.setData1("* กระเทียมสับ\n" +
                "* พริกขี้หนูทุบ\n" +
                "* เนื้อไก่หั่นชิ้น (จริง ๆ ไม่ใส่เนื้อสัตว์ก็อร่อยค่ะ)\n" +
                "* เห็ดฟาง\n" +
                "* น้ำมันหอย\n" +
                "* ซีอิ๊วขาว\n" +
                "* ใบโหระพา");
        a39.setName2("ขั้นตอนการทำ");
        a39.setData2("1. ใส่น้ำมันลงในกระทะ นำกระเทียม และพริกขี้หนูลงไปผัดให้หอม \n" +
                "2. ใส่เนื้อไก่ลงไปผัดพอสุก\n" +
                "3. ใส่เห็ดลงไปผัด ปรุงรสด้วยน้ำมันหอย ซีอิ๊วขาว ใส่น้ำเปล่านิดหน่อย \n" +
                "4. พอสุกใส่ใบโหระพา ตักใส่จาน พร้อมเสิร์ฟ ");


        a40 = new DataFood();
        a40.setName("ปลาต้มกระชาย");
        a40.setLmage((int)R.drawable.a40);
        a40.setName1("ส่วนผสม");
        a40.setData1("* ปลานิล ปลาทับทิม ปลาช่อน หรือเนื้อไก่ เลือกตามชอบ (แต่วันนี้อ้อใช้ปลานิลค่ะ นำมาหั่นเป็นชิ้น ๆ ตามชอบ)\n" +
                "* กระชายทุบ (ครั้งแรกควรใส่น้อย ๆ บางท่านอาจไม่คุ้นเคยค่ะ)\n" +
                "* เกลือป่น\n" +
                "* น้ำปลา\n" +
                "* ผงปรุงรสนิดหน่อย (เพื่อร่นระยะเวลาค่ะ)\n");
        a40.setName2("ขั้นตอนการทำ");
        a40.setData2("1. ต้มน้ำให้เดือด ใส่เกลือ น้ำปลา และผงปรุงรส ชิมรสตามชอบ (ไม่ต้องเค็มมาก)\n" +
                "2. พอน้ำเดือด ใส่กระชายทุบลงไป พอเดือดอีกครั้งใส่เนื้อปลาลงไปเบาๆทีละชิ้น(ในขั้นตอนนี้ห้ามคนเด็ดขาดจนกว่าปลาจะสุก)");


        a41 = new DataFood();
        a41.setName("หอยทอด");
        a41.setLmage((int)R.drawable.a41);
        a41.setName1("ส่วนผสม");
        a41.setData1("* แป้งครัวครบรส (สูตรต้นตำรับ) 4 ช้อนโต๊ะ\n" +
                "* น้ำเย็นจัด 1 ถ้วย\n" +
                "* หอยแมลงภู่ชิลี 100 กรัม\n" +
                "* ต้นหอมซอย\n" +
                "* ไข่ไก่ 1 ฟอง\n" +
                "* ซอสพริก\n" +
                "* ถั่วงอกหรือผักอื่นๆที่มีในบ้าน");
        a41.setName2("ขั้นตอนการทำ");
        a41.setData2("1.ละลายแป้งครัวครบรสในน้ำเย็นจัด คนผสมจนแป้งละลายและไม่เป็นเม็ด ใส่หอยแมลงภู่ และหอมซอยลงไป คนผสมให้เข้ากัน พักไว้\n" +
                "2.ใส่น้ำมัน(เยอะพอควร)ลงในกระทะเทฟลอนชนิดแบน พอน้ำมันร้อนได้ที่ (ทดสอบโดยนำแป้งหยดลงไป ถ้าฟูขึ้นมาแสดงว่าใช้ได้) \n" +
                "    เทส่วนผสมแป้งกับหอยแมลงภู่ลงกระทะ เกลี่ยให้แผ่ออกเป็นแผ่นกลม จากนั้นตอกไข่ใส่ลงไป เกลี่ยให้ทั่ว ");


        a42 = new DataFood();
        a42.setName("ปลากระพงผัดสะตอ");
        a42.setLmage((int)R.drawable.a42);
        a42.setName1("ส่วนผสม");
        a42.setData1("* เนื้อปลากระพง 10-15 ชิ้น หั่นให้เป็นชิ้นขนาดพอดีคำ\n" +
                "* เกลือป่น 1 ช้อนชา\n" +
                "* แป้งข้าวโพด 4 ช้อนโต้ะ\n" +
                "* สะตอ 10-15 เม็ด นำมาผ่าครึ่ง\n" +
                "* หอมแดงหัวแดง 1 หัว นำมาซอย\n" +
                "* กระเทียม 2-3 กลีบ นำมาซอย\n" +
                "* พริกขี้หนูสวน 5-6 เม็ด นำมาซอย\n" +
                "* กะปิ 1 ช้อนชา\n" +
                "* น้ำปลา 1 ช้อนโต๊ะ\n" +
                "* น้ำตาลปี๊บ 1 ช้อนชา\n" +
                "* ใบมะกรูดซอย 3 ใบ\n" +
                "* น้ำเปล่า 2 ช้อนโต๊ะ\n" +
                "* นำมันพืชสำหรับทอดปลา ปริมาณท่วมตัวปลา\n" +
                "* น้ำมันพืช สำหรับผัด 2 ช้อนโต้ะ");
        a42.setName2("ขั้นตอนการทำ");
        a42.setData2("1.เมื่อล้างปลาจนสะอาดแล้ว ให้นำเนื้อปลาไปคลุกเกลือป่นก่อน จากนั้นนำไปคลุกกับแป้งข้าวโพด สำหรับทอด\n" +
                "2.จากนั้น ตั้งกระทะนำมันให้ร้อน นำเนื้อปลากระพงลงไปทอดให้เหลืองกรอบ เมื่อได้เนื้อปลากระพงทอด แล้ว ให้พักเอาไว้ก่อน\n" +
                "3.เตรียมทำพริกแกง โดยโขรก พริกขี้หนูสวน หอมหัวแดง กระเทียม และ กะปิ นำมาโขรกให้ละเอียด\n" +
                "4.ตั้งกระนะน้ำมันสำหรับผัด ใส่พริกแกงลงไปผัด ผัดให้หอม จากนั้นใส่ สะตอ และ ใบมะกรูดลงไป \n" +
                "   และปรุงรสด้วย น้ำตาลปี๊บ น้ำปลา เติมน้ำลงไปนิดหน่อย ผัดให้ส่วนผสมเข้ากัน และ ชิมรสชาติให้ได้รสชาติที่ต้องการ\n" +
                "5.ปิดไฟ และ ใส่ปลากระพงทอดลงไปผัดให้พริกแกงคลุกเคล้าปลา เสริฟใส่จานพร้อมรับประทานได้");


        a43 = new DataFood();
        a43.setName("ยำหอยแครง");
        a43.setLmage((int)R.drawable.a43);
        a43.setName1("ส่วนผสม");
        a43.setData1("* เนื้อหอยแครงลวก (พอสุก) 100 กรัม\n" +
                "* ตะไคร้ซอย 3 ช้อนโต๊ะ\n" +
                "* มะม่วงเปรี้ยวสับ 1/2 ถ้วย\n" +
                "* พริกขี้หนูซอย \n" +
                "* ใบสะระแหน่เด็ดเป็นใบ\n" +
                "* แรดิชฝานบาง ๆ (อ้อใช้เป็นเครื่องเคียงนะคะ)\n" +
                "* น้ำพริกเผา \n" +
                "* น้ำตาลทราย\n" +
                "* น้ำปลา \n" +
                "* น้ำมะนาว (อาจไม่ต้องใส่ถ้ามะม่วงเปรี้ยวมากอยู่แล้ว)");
        a43.setName2("ขั้นตอนการทำ");
        a43.setData2("1. ลวกเนื้อหอยแครง นำใส่ชามผสม ตามด้วยตะไคร้ซอย มะม่วงสับ พริกขี้หนูซอย และใบสะระแหน่เล็กน้อย เตรียมไว้\n" +
                "2. ใส่น้ำพริกเผา น้ำปลา น้ำมะนาว และน้ำตาลทราย คนผสมให้ละลาย จากนั้นนำไปใส่ในชามหอยแครงลวก\n" +
                "   คลุกเคล้าให้เข้ากัน ชิมรสตามชอบ โรยหน้าด้วยใบสะระแหน่ พร้อมเสิร์ฟ\n");


        a44 = new DataFood();
        a44.setName("แกงส้มปลาช่อนผักรวม");
        a44.setLmage((int)R.drawable.a44);
        a44.setName1("ส่วนผสม");
        a44.setData1("* ปลาช่อน หั่นเป็นท่อนๆ 1 ถ้วย\n" +
                "* น้ำพริกแกงส้ม 1 ช้อนโต้ะ\n" +
                "* ผักกวางตุ้ง หั่นทอน 200 กรัม\n" +
                "* หัวไชเท้า หั่น 2 ชิ้น\n" +
                "* ถั่วฝักยาว หั่นพอคำ 5 ช้อนโต้ะ\n" +
                "* น้ำเปล่า 2 ถ้วย\n" +
                "* น้ำตาลปี๊บ 1 ช้อนชา\n" +
                "* น้ำปลา 2 ช้อนโต๊ะ\n" +
                "* น้ำมะขามเปียก 3 ช้อนโต๊ะ\n" +
                "* ผักกาดขาว หั่นเป้นชิ้นพอคำ");
        a44.setName2("ขั้นตอนการทำ");
        a44.setData2("1.ต้มน้ำให้เดือด จากนั้นใส่ปลาช่อนลงไปต้มจนสุก\n" +
                "2.นำปลาช่อน พักไว้ก่อน และแกะเนื้อออกมาโขรกกับน้ำพริกแกงส้มให้เข้ากัน\n" +
                "3.นำน้ำพริกแกง ที่โขรกกับเนื้อปลาช่อน ลงไปต้ม จากนั้นเพิ่มไฟให้แรงจัด ปรุงรสด้วยน้ำปลา น้ำตาล และ น้ำมะขามเปียก\n" +
                "4.ใส่ผักที่เตรียมไว้ลงไปต้ม และเสริฟใส่ชาม ทานกับข้าวสวยร้อนๆ");

        a45 = new DataFood();
        a45.setName("กุ้งผัดผงกะหรี่");
        a45.setLmage((int)R.drawable.a45);
        a45.setName1("ส่วนผสม");
        a45.setData1("* กุ้งกุลาดำ 7-8 ตัวกุ้งตัวใหญ่ๆ แกะเปลือก ผ่าเส้นที่หลัง และ เอาหัวออก\n" +
                "* ต้นหอมให้เป็นท่อน 1 ต้น\n" +
                "* ผงกะหรี่ 1 ช้อนโต้ะ\n" +
                "* หอมหัวใหญ่ หั่นเป็นชิ้น 2 ช้อนโต๊ะ\n" +
                "* ซีอิ้วขาว 1 ช้อนโต๊ะ\n" +
                "* ซอสน้ำมันหอย 1 ช้อนโต้ะ\n" +
                "* น้ำตาลปี๊บ 1 ช้อนโต๊ะ\n" +
                "* เกลือป่น 1 ช้อนชา\n" +
                "* นมข้นจืด 2 ช้อนโต๊ะ\n" +
                "* พริกชี้ฟ้าหั่นเฉียง 3-4 เม็ด\n" +
                "* ไข่ไก่ 1 ฟอง\n" +
                "* คึ่นช่าย หั่นเป็นท่อน 1 ต้น\n" +
                "* น้ำมันพืชสำหรับผัก 1 ช้อนโต้ะ\n");
        a45.setName2("ขั้นตอนการทำ");
        a45.setData2("1.เริ่มจากการล้างกุ้งให้สะอาดก่อน จากนั้น ปรุงรสไข่ก่อน โดย ตอกไข่ ใส่ผงกะหรี่ น้ำตาลปี๊บ ซีอิ้วขาว ซอสน้ำมันหอยและ เกลือ " +
                "  ผสมให้ส่วนผสมเข้ากัน และ น้ำตาลละลายก่อน\n" +
                "2.ตั้งกระทะน้ำมันให้ใส่กุ้งลงไปผัดให้สุก จากนั้นใส่ไข่ไก่ปรุงรสชาติลงไป ผัดเร็วๆ ให้ส่วนผสมสุก ใ่ส่นมค้นจืดลงไป\n" +
                "3.ใส่หอมหัวใหญ่ คื่นฉ่าย พริกชี้ฟ้า และ ต้นหอม ปิดไฟ\n" +
                "4.เสริฟอาหารใส่จานพร้อมรับประทาน");

        a46 = new DataFood();
        a46.setName("ปลากะพงสามรส");
        a46.setLmage((int)R.drawable.a46);
        a46.setName1("ส่วนผสม");
        a46.setData1("* ปลากะพง 1 ตัว\n" +
                "* กระเทียมสับ 2 ช้อนโต๊ะ\n" +
                "* พริกขี้หนูแดงโขลกละเอียด 2 ช้อนชา\n" +
                "* น้ำตาลปี๊บ 3 ช้อนโต๊ะ\n" +
                "* น้ำปลา 2 ช้อนโต๊ะ\n" +
                "* น้ำมะขามเปียก ¼ ถ้วย\n" +
                "* ผักชีหั่นหรือเด็ดเป็นใบๆ 1 ต้นสำหรับโรยหน้า\n" +
                "* พริกชี้ฟ้า (ไม่ใส่ก็ได้) สำหรับโรยหน้า");
        a46.setName2("ขั้นตอนการทำ");
        a46.setData2("1.ปลากะพงล้างทำความสะอาด ควักไส้ออกด้วยนะ บั้งทั้งสองด้าน\n" +
                "2.ใส่น้ำมันลงในกระทะประมาณ 1 ถ้วย นำปลาลงไปทอดให้เหลืองกรอบ ตักขึ้นสะเด็ดน้ำมันให้ดี\n" +
                "3.ตั้งกะทะหรือใช้หม้อก็ได้ค่ะ ใส่น้ำตาลปี๊บ น้ำปลาน้ำมะขามเปียก ผสมกันแล้วใส่พริกและกระเทียมลงไป \n" +
                "4.ยกขึ้นตั้งไฟ รอจนเดือด เคี่ยวด้วยไฟอ่อนให้ข้น เทราดบนตัวปลา จากนั้นโรยหน้าด้วยผักชีและพริกชี้ฟ้า");

        a47 = new DataFood();
        a47.setName("ผัดกะเพรา");
        a47.setLmage((int)R.drawable.a47);
        a47.setName1("ส่วนผสม");
        a47.setData1("* น้ำมันพืช 1 ช้อนโต๊ะ\n" +
                "* กระเทียมสับ 1 ช้อนโต๊ะ\n" +
                "* พริก ตามชอบ\n" +
                "* หมูสับ 200 กรัม\n" +
                "* ซอสหอยนางรม 1 ช้อนโต๊ะ\n" +
                "* น้ำปลา 1 ช้อนโต๊ะ\n" +
                "* น้ำตาลทราย 2 ช้อนชา\n" +
                "* ซีอิ๊วดำ 2 ช้อนชา\n" +
                "* ใบกะเพรา ตามชอบ");
        a47.setName2("ขั้นตอนการทำ");
        a47.setData2("1.เทน้ำมันพืชลงไปเล็กน้อย ตามด้วยกระเทียมสับและพริกตามชอบ ผัดจนมีกลิ่นฉุน\n" +
                "2.ใส่หมูบดลงไปผัดให้พอสุก ปรุงรสด้วยซอสหอยนางรม น้ำปลา น้ำตาลทราย และซีอิ๊วดำ ผัดจนเข้ากัน\n" +
                "3.ใส่ใบกะเพราลงไปผัด ผัดจนใบกะเพราะสลด แล้วตักราดข้าว");

        a48 = new DataFood();
        a48.setName("มัสมั่นไก่");
        a48.setLmage((int)R.drawable.a48);
        a48.setName1("ส่วนผสม");
        a48.setData1("* สะโพกไก่ 500 กรัม\n" +
                "* หางกะทิ (หรือใช้หัวกะทิ 1 ถ้วย + น้ำ 1 ถ้วย) 2 ถ้วย\n" +
                "* หัวกะทิ 1 ถ้วย\n" +
                "* พริกแกงมัสมั่น 1/3 ถ้วย\n" +
                "* หอมใหญ่หั่นสี่ 1 ลูก\n" +
                "* มันฝรั่งหั่นชิ้นพอคำ 1 ลูก\n" +
                "* ใบกระวาน 3 ใบ\n" +
                "* ลูกกระวานคั่ว 5 ลูก\n" +
                "* อบเชย 1 แท่ง น้ำตาลปีบ 2 ช้อนโต๊ะ \n" +
                "* น้ำมะขามเปียก 2 ช้อนโต๊ะ น้ำปลา 1/2 ช้อนโต๊ะ\n" +
                "* คนอร์อร่อยชัวร์ไก่ 1 ช้อนชา \n" +
                "* ถั่วลิสงคั่ว 2 ช้อนโต๊ะ");
        a48.setName2("ขั้นตอนการทำ");
        a48.setData2("1.ใส่หางกะทิลงในหม้อ ยกขึ้นตั้งไฟกลางจนร้อน ใส่สะโพกไก่ลงไปต้ม รอจนเดือดแล้วลดเป็นไฟอ่อน เคี่ยวประมาณ 15 นาที จนเนื้อไก่สุกนุ่ม\n" +
                "2.ระหว่างเคี่ยวเนื้อไก่กับหางกะทิ ให้เริ่มผัดพริกแกงมัสมั่นได้เลย เริ่มจากใส่หัวกะทิเพียงครึ่งหนึ่งลงเคี่ยวจนแตกมัน เพื่อให้กะทิเข้มข้น \n" +
                "   และมีกลิ่นหอม จากนั้นใส่พริกแกงมัสมั่นลงไปผัดจนส่งกลิ่นหอม แล้วค่อยๆ ใส่หัวกะทิที่เหลือลงไปผัดจนหมด\n" +
                "3.เทพริกแกงที่ผัดลงในหม้อต้มไก่ เร่งไฟปานกลาง รอจนเดือดอีกครั้ง\n" +
                "4.ใส่หอมใหญ่ มันฝรั่ง ใบกระวาน ลูกกระวาน และอบเชยลงไป เคี่ยวต่อจนหอมใหญ่ และมันฝรั่งสุกนุ่ม\n" +
                "5.ปรุงรสด้วย น้ำตาลปีบ น้ำมะขามเปียด น้ำปลา และคนอร์อร่อยชัวร์ไก่ จากนั้นใส่ถั่วลิสงคั่วลงไป แล้วปิดไฟ ตักใส่ชามเสิร์ฟได้เลย ");

        a49 = new DataFood();
        a49.setName("แกงคั่วปลาอินทรีย์ใบชะพลู\n");
        a49.setLmage((int)R.drawable.a49);
        a49.setName1("ส่วนผสม");
        a49.setData1("* ปลาอินทรีย์สด\n" +
                "* เครื่องแกงคั่วใต้ (เครื่องแกงใต้จะใส่ขมิ้น)\n" +
                "* กะทิ\n" +
                "* ใบชะพลู\n" +
                "* น้ำตาล\n" +
                "* น้ำปลา\n");
        a49.setName2("ขั้นตอนการทำ");
        a49.setData2("1.เอาเครื่องแกงไปผัดกับน้ำมันให้หอม เติมกะทินิดนึงผัดจนหอม เอาปลาลงไป\n" +
                "2.เติมน้ำกะทิตั้งไฟให้เดือดอย่าคนปลานะค่ะรอเดือดหน่อย ใส่ใบชะพลูลงไป\n" +
                "3.ปรุงรสด้วยน้ำปลา น้ำตาลนิดนึง ชิมรสตามชอบ พอเดือด อีกครั้งปิดไฟ ");

        a50 = new DataFood();
        a50.setName("แกงกะทิสายบัวปลาทู");
        a50.setLmage((int)R.drawable.a50);
        a50.setName1("ส่วนผสม");
        a50.setData1("* ปลาทู 2 ตัว\n" +
                "* สายบัวหั่นเป็นชิ้นพอคำ 1 ถ้วย\n" +
                "* หางกะทิ 2 ถ้วยตวง\n" +
                "* หัวกะทิ 1/2 ถ้วยตวง\n" +
                "* กะปิ 1 ช้อนโต้ะ\n" +
                "* น้ำมะขามเปียก 2 ช้อนโต้ะ\n" +
                "* น้ำตาลปี๊บ 1 ช้อนโต้ะ\n" +
                "* พริกชี้ฟ้าหั่นเฉียง 2 ช้อนโต้ะ\n" +
                "* หอมแดงซอย 1 ช้อนโต้ะ\n" +
                "* น้ำปลา 1 ช้อนโต้ะ\n" +
                "* พริกไทยดำป่น 1 ช้อนโต้ะ");
        a50.setName2("ขั้นตอนการทำ");
        a50.setData2("1.ต้มน้ำให้เดือด จากนั้นปิดไฟ นำปลาทูลงไปแช่ในน้ำเดือด ประมาณ 30 นาที จากนั้นนำปลาทูออกมาพักเอาไว้ก่อน\n" +
                "2.ตั้งหม้อต้ม ใส่ หางกะทิลงไปต้ม ด้วยไฟอ่อนๆ ใส่ กะปิ น้ำตาลปี๊บ พริกไทยและน้ำมะขามเปี๊ยก \n" +
                "  เมื่อส่วนผสมละลายแล้วให้ใส่ ปลาทูลงไปต้ม พร้อมด้วยสายบัว\n" +
                "3.ต้มต่อไปด้วยไฟอ่อนๆ ใส่ พริกชี้ฟ้าสด และ หอมแดงลงไป เมื่อต้มลงไปสักพักหนึ่ง ให้กลับตัวปลาทู\n" +
                "4.ชิมรสชาติ หากรสไม่กลมกล่อม ให้เติมน้ำปลาลงไป เมื่อรสชาติได้ที่\n" +
                "5.ให้ปิดไฟ และ ใส่หัวกะทิลงไป แล้วเสริฟใส่จาน");








        order = (TextView) findViewById(R.id.ME);
        order.setText(a1.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a1);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME2);
        order.setText(a2.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a2);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME3);
        order.setText(a3.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a3);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME4);
        order.setText(a4.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a4);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME5);
        order.setText(a5.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a5);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME6);
        order.setText(a6.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a6);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME7);
        order.setText(a7.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a7);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME8);
        order.setText(a8.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a8);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME9);
        order.setText(a9.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a9);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME10);
        order.setText(a10.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a10);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME11);
        order.setText(a11.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a11);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME12);
        order.setText(a12.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a12);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME13);
        order.setText(a13.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a13);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME14);
        order.setText(a14.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a14);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME15);
        order.setText(a15.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a15);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME16);
        order.setText(a16.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a16);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME17);
        order.setText(a17.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a17);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME18);
        order.setText(a18.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a18);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME19);
        order.setText(a19.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a19);
                startActivity(intent);
            }
        });
        order = (TextView) findViewById(R.id.ME20);
        order.setText(a20.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a20);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME21);
        order.setText(a21.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a21);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME22);
        order.setText(a22.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a22);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME23);
        order.setText(a23.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a23);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME24);
        order.setText(a24.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a24);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME25);
        order.setText(a25.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a25);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME26);
        order.setText(a26.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a26);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME27);
        order.setText(a27.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a27);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME28);
        order.setText(a28.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a28);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME29);
        order.setText(a29.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a29);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME30);
        order.setText(a30.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a30);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME31);
        order.setText(a31.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a31);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME32);
        order.setText(a32.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a32);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME33);
        order.setText(a33.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a33);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME34);
        order.setText(a34.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a34);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME35);
        order.setText(a35.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a35);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME36);
        order.setText(a36.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a36);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME37);
        order.setText(a37.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a37);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME38);
        order.setText(a38.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a38);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME39);
        order.setText(a39.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a39);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME40);
        order.setText(a40.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a40);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME41);
        order.setText(a41.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a41);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME42);
        order.setText(a42.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a42);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME43);
        order.setText(a43.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a43);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME44);
        order.setText(a44.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a44);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME45);
        order.setText(a45.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a45);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME46);
        order.setText(a46.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a46);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME47);
        order.setText(a47.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a47);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME48);
        order.setText(a48.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a48);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME49);
        order.setText(a49.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a49);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.ME50);
        order.setText(a50.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main2Activity.this,Main5Activity.class);
                intent.putExtra("data", a50);
                startActivity(intent);
            }
        });

        }
}
