package com.example.myapplication;

import android.content.Intent;
import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.view.View;
import android.widget.TextView;

public class Main6Activity extends AppCompatActivity {
    DataFood b1,b2,b3,b4,b5,b6,b7,b8,b9,b10,b11,b12,b13,b14,b15,b16,b17,b18,b19,b20,b21,b22,b23,b24,b25;


    private TextView order;
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_main6);


        b1 = new DataFood();
        b1.setName(" สังขยาฟักทอง ");
        b1.setLmage((int)R.drawable.b1);
        b1.setName1("ส่วนผสม");
        b1.setData1("* ฟักทองทั้งลูก คว้านเอาไส้และเม็ดออก\n" +
                "* หัวกะทิ 125 กรัม\n" +
                "* น้ำตาลปี๊บ 200 กรัม\n" +
                "* ไข่ไก่ 2 ฟอง\n" +
                "* ไข่เป็ด 2 ฟอง ไข่เป็ดจะทำให้ขนมหอม\n" +
                "* มัน,ใบเตย,เกลือ");
        b1.setName2("ขั้นตอนการทำ");
        b1.setData2("1.ใส่หัวกะทิลงชามผสม จากนั้นใส่ใบเตย น้ำตาลปี๊บคนให้ละลาย ใส่ไข่ทีละฟอง และเกลือ และคนรวมกัน\n" +
                "2.เอาตระแกรงมากรองออก เพื่อให้ได้สังขยาเนื้อเนียน เทส่วนผสมใส่ในฟักทอง \n" +
                "3.นำไปนึ่ง ประมาณ 1 ชั่วโมง ให้ฟักทองนิ่ม เวลาเสิร์ฟให้ผ่าออกเป็นชิ้น\n");
        b1.setIu("");

        b2 = new DataFood();
        b2.setName("ขนมครองแครงน้ำกะทิ");
        b2.setLmage((int)R.drawable.b2);
        b2.setName1("ส่วนผสม");
        b2.setData1("* แป้งมัน 4 ถ้วย\n" +
                "* แป้งข้าวเจ้า 1 ถ้วย\n" +
                "* ดอกอัญชัน 20 ดอก\n" +
                "* กะทิ 2 กล่อง\n" +
                "* เกลือ 1 ช้อนชา\n" +
                "* น้ำตาลทรายขาว\n" +
                "* ใบเตย\n" +
                "* งาขาวคั่ว");
        b2.setName2("ขั้นตอนการทำ");
        b2.setData2("1.ในสูตรทำ 2 สี คือสีน้ำเงินและสีฟ้า แบ่งครึ่งแป้งทั้ง 2 ชนิด นำแป้งมันผสมกับแป้งข้าวเจ้าแบ่งใส่กะละมังไว้ 2 ใบ ต้มน้ำให้เดือดแล้วใส่ดอกอัญชันลงไป รอจนน้ำเปลี่ยนเป็นสีน้ำเงินเข้มแล้วจึงตักดอกอัญชันออก\n" +
                "2.แบ่งน้ำดอกอัญชันที่ต้มเดือดแล้วค่อย ๆ เทลงไปในกะละมังแป้งใบแรก รีบคนจนเข้ากัน เพราะถ้าคนช้าแป้งจะสุกเกินไป คนเสร็จก็ใช้มือนวดต่อ แบ่งเป็นก้อนเล็ก ๆ และนำน้ำดอกอัญชันที่เหลือมาเติมน้ำเปล่าแล้วตั้งไฟให้เดือดอีกรอบ เทใส่แป้งที่แบ่งไว้อีกครึ่งหนึ่ง นวดจนเข้ากันและแบ่งเป็นก้อนเล็ก ๆ\n" +
                "3.นำก้อนแป้งที่เตรียมไว้มาคลึงให้เป็นเส้นยาว ๆ เส้นผ่าศูนย์กลางไม่ควรเกิน 1 เซนติเมตร เพราะครองแครงจะตัวใหญ่เกินไป พอคลึงแล้วก็ตัด เสร็จแล้วก็เอามากดลงบนพิมพ์กดทำครองแครง เอานิ้วมือถูแป้งไปด้านหน้า แป้งก็จะม้วนตามนิ้ว ทำจนแป้งหมด\n" +
                "4.นำหม้อมาใส่น้ำแล้วตั้งไฟกลางไปทางแรง อาจจะใส่ใบเตยไปด้วย พอเดือดใส่ตัวครองแครงลงไปต้ม ประมาณ 30 วินาทีหรือจนสุก พอตักขึ้นมาแล้วก็ไปล้างน้ำ พักไว้\n" +
                "5.ตั้งหม้อใช้ไฟอ่อน เติมกะทิ เกลือ น้ำตาลทราย และใบเตย พอกะทิเดือดใส่ครองแครงลงไป รอเดือดอีกรอบปิดไฟ โรยงาคั่ว ตักใส่ถ้วย");
        b2.setIu("");

        b3 = new DataFood();
        b3.setName("ขนมเปียกปูนกะทิสด \n");
        b3.setLmage((int)R.drawable.b3);
        b3.setName1("ส่วนผสม");
        b3.setData1("* แป้งข้าวเจ้า 1 ถ้วยตวง\n" +
                "* แป้งมัน 1/4 ถ้วยตวง\n" +
                "* น้ำปูนใส 1 ถ้วยตวง\n" +
                "* น้ำใบเตย 2 ถ้วยตวง\n" +
                "* เกลือเล็กน้อย\n" +
                "* น้ำตาลทรายแดง 1/4 ถ้วยตวง\n" +
                "* น้ำตาลปี๊บ 120 กรัม\n" +
                "* กะทิ 500 กรัม\n" +
                "* แป้งข้าวเจ้า 1 ช้อนชา \n" +
                "* งาขาวคั่ว");
        b3.setName2("ขั้นตอนการทำ");
        b3.setData2("1.นำแป้งข้าวเจ้า แป้งมัน น้ำปูนใส และน้ำใบเตยผสมกันและนวดจนเข้ากันดี\n" +
                "2.ใส่เกลือ น้ำตาลทรายแดง และน้ำตาลปี๊บ นวดต่อจนเข้ากันดี กรองส่วนผสมแป้งด้วยตะแกรง 1 รอบ\n" +
                "3.ตั้งกระทะเปิดไฟปานกลาง ใส่แป้งลงไปกวน พอแป้งเริ่มจับตัวเป็นก้อนให้ลดเป็นไฟอ่อน ค่อย ๆ กวนต่อจนส่วนผสมเนียนเข้ากันดี \n" +
                "   สังเกตจากการเอาไม้พายตักแป้งขึ้นมา ถ้าแป้งเหนียวติดไม้พายก็ใช้ได้แล้ว ตักขนมเปียกปูนใส่ถุงบีบ และใช้หัวบีบแต่งหน้าเค้ก บีบใส่ถ้วย\n" +
                "4.ทำกะทิราดหน้าขนม โดยใส่หัวกะทิลงในหม้อ ตามด้วยเกลือ ใส่แป้งข้าวเจ้า คนผสมจนเดือด เสร็จแล้วตักกะทิราดหน้าขนมเปียกปูน โรยงาขาว");
        b3.setIu("");

        b4 = new DataFood();
        b4.setName("ขนมทองหยิบ");
        b4.setLmage((int)R.drawable.b4);
        b4.setName1("ส่วนผสม");
        b4.setData1("* ไข่เป็ด 10 ฟอง โดยแยกเอาเฉพาะไข่แดง\n" +
                "* น้ำตาลทราย 3 ถ้วย\n" +
                "* น้ำลายดอกไม้ 2 ถ้วย");
        b4.setName2("ขั้นตอนการทำ");
        b4.setData2("1.การทำน้ำลอยดอกมะลิ น้ำลอยดอกมะลิจะเริ่มจากการเตรียมน้ำสะอาด จากนั้นนำดอกมะลิ หอมๆ ที่เป็นดอกไม้เด็ดแบบสดๆ \n" +
                "   นำลงไปลอยในน้ำสะอาด และ ทิ้งให้นำสะอาดหอมกลิ่นดอกมะลิ ก่อน ใช้เวลาในการเตรียมน้ำลอยดอกมะลิ คือ 1 คืน\n" +
                "2.เมื่อเราได้น้ำลอยดอกไม้ และ นำน้ำลอยดอกมะลิ ไปต้มให้เดือด ใส่น้ำตาลลงไป เคี้ยวให้น้ำตาลค้น เหนียว \n" +
                "   สามารถใส่ใบเตยลงไปได้ ในระหว่างที่เคี้ยวน้ำเชื่อม ให้ไปเตรียมไข่\n" +
                "3.เริ่มทำขนมทองหยิบ โดย นำไข่เป็ดที่เตรียมไว้ นำมาตีให้แตกฟอง ขึ้นฟู หากมีเครื่องช่วยตีไข่\n" +
                "   จะช่วยในการผ่อนแรงได้มาก ตีไข่แดงจนไข่แดงขึ้นฟู จากนั้นพักไว้ก่อน\n" +
                "4.เมื่อน้ำเชื่อมได้ที่แล้ว ให้นำกระบวยตักไข่ให้เป็นลักษณะแผ่น ใส่ไข่ลงไป และนำไปต้มให้เป็นแผ่น\n" +
                "   เมื่อไข่สุกไข่จะเกาะตัวและ เป็นแผ่น ลอยหลุดจากกระบวย เราก็ทำการเชื่อมมันให้เข้าเนื้อ เมื่อไข่สุดได้ที่\n" +
                "5.ให้นำแผ่นไข่ ลงไปจีบใส่ถ้วยพิมพ์ ที่เตรียมเอาไว้ พักให้เย็นก็สามารถรับประทานได้");
        b4.setIu("");

        b5 = new DataFood();
        b5.setName("กล้วยบวชชี");
        b5.setLmage((int)R.drawable.b5);
        b5.setName1("ส่วนผสม");
        b5.setData1("* กล้วยน้ำว้าสุก แต่ไม่งอม 8 ลูก\n" +
                "* หางกะทิ 1 ถ้วย\n" +
                "* หัวกะทิ 1 ถ้วย\n" +
                "* เม็ดสาคู 1 ถ้วย\n" +
                "* น้ำตาล 1 ถ้วย\n" +
                "* เกลือ 1 ช้อนโต้ะ");
        b5.setName2("ขั้นตอนการทำ");
        b5.setData2("1.น้ำหัวกะทิ และหางกะทิลงไปต้ม ให้ร้อนจากนั้นเติม น้ำตาลและเกลือลงไป\n" +
                "2.นำสาคูที่แช่น้ำไว้แล้วประมาณ 1 ชั่วโมงลงไปต้ม จากนั้นหั่นกล้วยเป็นชิ้นพอคำลงไปต้ม\n" +
                "3.เคี่ยวจนเม็ดสาคูสุกและกล้วยสุก เสริฟใส่ถ้วยรับประทาน");
        b5.setIu("");

        b6 = new DataFood();
        b6.setName("ขนมตาล");
        b6.setLmage((int)R.drawable.b6);
        b6.setName1("ส่วนผสม");
        b6.setData1("* ผลตาลสุก 1 ผล\n" +
                "* ข้าวสารเก่า 2 ถ้วย\n" +
                "* แป้งท้าวยายม้อม 2 ช้อนโต้ะ\n" +
                "* น้ำตาลทราย 2 ถ้วย\n" +
                "* เนื้อมะพร้าวขูด 2 ถ้วย\n" +
                "* เกลือ 1 ช้อนชา");
        b6.setName2("ขั้นตอนการทำ");
        b6.setData2("1.ปลอกเปลือกลูกตาลออกจากนั้นขูดเอาแต่เนื้อลูกตาลสีเหลืองออก และนำตัวลูกตาลไปแช่น้ำไว้จนเนื้อลูกตาลละลายออกหมด\n" +
                "2.จากนั้นใช้ผ้าห่อเนื้อลูกตาลผูกมัดปากไว้ให้แน่นแขวนไว้ให้แห้ง\n" +
                "3.นำข้าวสารไปแช่น้ำไว้ให้เนื้อข้าวสารอ่อน จากนั้นนำไปโม่ให้ละเอียด แล้วทับให้แห้ง\n" +
                "4.ผสมข้าวสารที่โม่ไว้แล้วกับ แป้งท้าวยายม่อม และ ลูกตาลที่ทับจนแห้งแล้ว นวดให้ส่วนผสมนุ่มเป็นเนื้อเดียวกันโดยปกติ\n" +
                "    แล้วจะใช้เวลาประมาณ 30-60 นาที จากนั้นใส่ น้ำตาล สลับกับ หัวกะทิ ลงไป นวดจนส่วนผสมเข้ากัน จากนั้นพักแป้งไว้ประมาณ 5-10 ชั่วโมง\n" +
                "5.นำแป้งที่พักไว้แล้วใส่แม่พิมพ์ นำไปนึ่งให้สุกฟูจากนั้นโรย มะพร้าวขูด ด้านบนขนมตาล แกะออกจากแม่พิมพ์เสริฟ ขนมตาล ใส่จาน");
        b6.setIu("");

        b7 = new DataFood();
        b7.setName("ขนมตะโก้");
        b7.setLmage((int)R.drawable.b7);
        b7.setName1("ส่วนผสม");
        b7.setData1("* แห้ว หั่นเป็นสี่เหลี่ยมเล็กๆ 1 ถ้วยตวง(อาจจะใส่เป็นข้าวโพด,เผือก)\n" +
                "* แป้งข้าวจ้าว 1 ช้อนโต้ะ\n" +
                "* น้ำตาลทราย 1 ถ้วยตวง\n" +
                "* น้ำดอกมะลิ 2 ถ้วยตวง\n" +
                "* หัวกะทิ 2 ถ้วยตวง\n" +
                "* เกลือ 1 ช้อนชา");
        b7.setName2("ขั้นตอนการทำ");
        b7.setData2("1.ใทำน้ำลอยดอกไม้ โดยการเด็ดดอกมะลิ เคล็ดลับต้องเด็ดดอกมะลิตอนกลางคืน ดอกมะลิจะให้ความหอม ให้แช่น้ำดอกมะลิทิ้งไว้ 1 คืน จะได้น้ำเปล่าที่หอมกลิ่นดอกมะลิ\n" +
                "2.เตรียมเนื้อแห้ว โดยนำน้ำล้างแห้วให้สะอาด และ หั่นเป้นชิ้นเล็กๆ\n" +
                "3.เตรียมเนื้อแป้งตะโก โดย ตั้งหม้อต้มผสม น้ำลอยดอกมะลิ แป้งข้าวจ้าว น้ำตาลทราย\n" +
                "4.นำแป้งตะโก้เทลงพิมพ์ใบตอง เทอค่ครึ่งหนี่ง ใส่แห้วลงไป หนึ่งชิ้น นำไปนึ่งให้สุก ใช้เวลาในการนึ่ง 15 นาที เมื่อแป้งเซ็ตตัว ให้นำออกมาพักให้เย็น\n" +
                "5.เตรียมน้ำราดกะทิ โดย ต้มหัวกะทิ เกลือ และ แป้งข้าวเจ้า ต้มจนกะทิสุกเหนียว จากนั้นให้เทกะทิลงบนพิมพ์ตะโก้\n" +
                "6.รอให้กะทิจับตัวกัน ก็สามารถเสริฟ ขนมตะโก้ ได้แล้ว");
        b7.setIu("");

        b8 = new DataFood();
        b8.setName("ขนมทองหยอด");
        b8.setLmage((int)R.drawable.b8);
        b8.setName1("ส่วนผสม");
        b8.setData1("* ไข่เป็ด 20 ฟอง ( แยกเอาเฉพาะไข่แดง )\n" +
                "* น้ำตาลทราย 1 กิโลกรัม\n" +
                "* น้ำลอยดอกมะลิ 3 ลิตร\n" +
                "* แป้งข้าวจ้าว 0.5 กิโลกรัม\n" +
                "* ใบเตย 5 ใบ\n" +
                "* เกลือ 1 ช้อนชา");
        b8.setName2("ขั้นตอนการทำ");
        b8.setData2("1.เริ่มจากการเตรียมน้ำลอยดอกมะลิ โดย นำน้ำสะอาด มาแช่ดอกมะลิ ทิ้งเอาไว้ก่อน 1 คืน โดย ดอกมะลิที่ใช้ในการแช่น้ำลอยดอกไม้\n" +
                "   ให้ใช้ดอกมะลิที่เด็ดตอนกลางคืน จะได้กลิ่นหอมของดอกไม้\n" +
                "2.เริ่มผสมแป้ง โดย นำไข่เป็ด 20 ฟอง ที่แยกไข่แดงนั้น มาตีให้ขึ้นฟู จากนั้นผสมแป้งข้าวจ้าว ตีให้ส่วนของไข่แดงและแป้งเข้ากัน\n" +
                "  ก็จะได้แป้งสำหรับหยอดน้ำ\n" +
                "3.เตรียมน้ำเชื่อม โดย ให้ใช้ น้ำลอยดอกมะลิ นำมาต้มให้เดือด ใส่ใบเตยลงไปต้ม ปรุงรสด้วย น้ำตาลทราย และ เกลือ \n" +
                "   เคี้ยวด้วยไฟอ่อนๆ ให้น้ำเชื่อมหวานกลมกล่อม\n" +
                "4.เริ่มทำการหยอดแป้ง โดยให้เร่งไฟน้ำเชื่อมให้เดือด จากนั้น นำแป้งมาหยอดลงในหม้อน้ำเชื่อม แป้งเมื่อลงไปในน้ำเชื่อม จะสุก\n" +
                "   และ มีลักษณะของหยดน้ำ ต้มให้แป้งสุก โดยสังเกตุว่าแป้งสุกจะลอยขึ้นมา");
        b8.setIu("");

        b9 = new DataFood();
        b9.setName("มะพร้าวแก้ว");
        b9.setLmage((int)R.drawable.b9);
        b9.setName1("ส่วนผสม");
        b9.setData1("* มะพร้าว ขูดเป็นเส้นๆ 2 ถ้วย\n" +
                "* น้ำตาลปี๊บ 1 ถ้วยตวง\n" +
                "* น้ำลอยดอกมะลิ 1/2 ถ้วย\n" +
                "* เกลือ 1/2 ช้อนชา");
        b9.setName2("ขั้นตอนการทำ");
        b9.setData2("1.ตั้งหม้อน้ำ ต้มน้ำลอยดอกมะลิและน้ำตาล เคี่ยวไปเรี่อยๆจนน้ำเชื่อมเริ่มเหนียว จากนั้นใส่เกลือลงไป จากนั้นปิดไฟปล่อยให้เย็น\n" +
                "2.นำ มะพร้าวขูด ลงไปผสมในน้ำเชี่อม จากนั้นนำมาพักใส่ถาดและ นำ มะพร้าวขูด จัดใส่แท่นพิมพ์\n" +
                "3.เสริฟใส่จานพร้อมรับประทาน ");
        b9.setIu("");

        b10 = new DataFood();
        b10.setName("วุ้นมะพร้าว");
        b10.setLmage((int)R.drawable.b10);
        b10.setName1("ส่วนผสม");
        b10.setData1("* น้ำมะพร้าว 1 ถ้วย\n" +
                "* เนื้อมะพร้าวอ่อน ซอยเล็กๆ 1 ถ้วย\n" +
                "* หัวกะทิ 1 ถ้วย\n" +
                "* น้ำตาล 1 ถ้วยตวง\n" +
                "* ผงวุ้น 8 ช้อนโต้ะ\n" +
                "* เกลือ 1 ช้อนชา");
        b10.setName2("ขั้นตอนการทำ");
        b10.setData2("1.นำน้ำมะพร้าว มาต้มให้เดือด จากนั้นใส่ ผงวุ้น 4 ช้อนโต้ะ จากนั้นต้มให้เดือด จะได้วุ้นฐาน\n" +
                "   นำมาราดที่พิมพ์วุ้น เทครึ่งเดียวจากนั้นพักให้วุ้นจับตัว\n" +
                "2.นำหัวกะทิ มาต้ม จากนั้นใส่ฝงวุ้น 4 ช้อนโต้ะ จามด้วยน้ำตาล 1 ถ้วย เกลือ 1 ช้อนชา \n" +
                "3.ผสมให้เข้ากัน เติมเนื้อมะพร้าวลงไป ต้มให้เดือด จากนั้นก็นำไปเทในพิมพ์ที่เตรียมไวเที่เหลืออีกครึ่งหนึ่ง \n" +
                "   ขั้นตอนนี้ต้องรอให้ฐานวุ้นจับตัวก่อนค่อยเทกะทิลงไป\n" +
                "4.พักให้เย็น วุ้นมะพร้าว จะจับตัวเป็นก้อนมีสองชั้น นำไปแช่เย็นก็พร้อนรับประทาน");
        b10.setIu("");

        b11 = new DataFood();
        b11.setName("ทับทิมกรอบ");
        b11.setLmage((int)R.drawable.b11);
        b11.setName1("ส่วนผสม");
        b11.setData1("* น้ำลอยดอกมะลิ\n" +
                "* กะทิสำเร็จรูป 1 กล่อง\n" +
                "* เกลือป่น 1/2 ช้อนโต๊ะ\n" +
                "* ใบเตยมัดเป็นปม\n" +
                "* ทียนสำหรับอบขนม\n" +
                "* แห้ว\n" +
                "* สีผสมอาหารสีแดงผสมน้ำ\n" +
                "* สีผสมอาหารสีเขียวผสมน้ำ\n" +
                "* แป้งมัน\n" +
                "* น้ำตาลทราย (ไม่ขัดสี)\n" +
                "* น้ำแข็งบด\n");
        b11.setName2("ขั้นตอนการทำ");
        b11.setData2("1.นำแห้วสดมาหั่นเต๋า แล้วนำไปแช่สีตามชอบ10นาที เอาขึ้นพักสะเด็ดน้ำ นำมาคลุกกับแป้งมันพักไว้ \n" +
                "2.ต้มน้ำจนเดือด นำทับทิมมาต้มจนตัวลอยใส่ ตักพักไว้ในอ่างน้ำแข็ง\n" +
                "3.ต้มน้ำตาลผสมกับหัวกะทิคนจนเข้ากันตักใส่ทับทิมตกแตงด้วยขนุน ฟินมากหน้าร้อน\n" +
                " ");
        b11.setIu("");

        b12 = new DataFood();
        b12.setName("ขนมชั้น");
        b12.setLmage((int)R.drawable.b12);
        b12.setName1("ส่วนผสม");
        b12.setData1("* แป้งเท้าย่อยม่อม 1/2 ถ้วย\n" +
                "* แป้งถั่วเขียว 1/2 ถ้วย\n" +
                "* แป้งมัน 2 ถ้วย\n" +
                "* แป้งข้าวจ้าว 1/3 ถ้วย\n" +
                "* กะทิ 4 ถ้วยตวง\n" +
                "* น้ำตาลเชื่อม 1 ถ้วยตวง\n" +
                "* เกลือ 1 ช้อนชา\n" +
                "* น้ำใบเตย 1 ถ้วยตวง\n");
        b12.setName2("ชั้นตอนการทำ");
        b12.setData2("1.ปั่นใบคั้นเอาน้ำ ผสมแป้งเข้ากัน แล้วค่อยๆเติมน้ำกะทินวดไปเรื่อยๆ เติมกะทิจนหมด เติมน้ำตาลเชื่อมเหลือไว้เล็กน้อย ใช้ผ้าขาวบางกรองน้ำแป้ง แล้วแบ่งเป็น 2 ถ้วย\n" +
                " ถ้วยที่จะเติมน้ำใบเตยจะน้อยหน่อย เติมน้ำใบเตยน้ำตาลเชื่อม คนให้เข้ากัน แล้วกรองอีกครั้ง\n" +
                "2.ตั้งกะทะ ต้มน้ำให้เดือด นึ่งถาดให้ร้อนก่อน แล้วใช่ถ้วยตวง สีขาว เทราด นึ่ง 5 นาที ตวงสีเขียว ราด ทำซ้ำไปเรื่อยๆ เมื่อถึง 5 ให้เพิ่มเวลาการนึ่งเพิ่มขึ้นตาม สักประมาณ 7-8 นาที\n" +
                "3.พักให้เย็นแล้วตัดเป็นชิ้น ");
        b12.setIu("");

        b13 = new DataFood();
        b13.setName("ไข่นกกระทา");
        b13.setLmage((int)R.drawable.b13);
        b13.setName1("สวนผสม");
        b13.setData1("* มันเทศ 500 กรัม\n" +
                "* แป้งมัน 200 กรัม\n" +
                "* แป้งสาลี 1/4 ถ้วย\n" +
                "* เกลือ 1/2 ช้อนชา\n" +
                "* น้ำตาล 3-4 ช้อนโต๊ะ\n" +
                "* ผงฟู 1/2 ช้อนชา\n" +
                "* กะทิ 1/2 ถ้วยตวง\n" +
                "* ไข่แดง 1 ฟอง");
        b13.setName2("ขั้นตอนการทำ");
        b13.setData2("1.นึ่งมันเทศให้สุกแล้วนำมายีให้ละเอียด\n" +
                "2.ผสมกะทิกับน้ำตาล เกลือ ไข่แดงคนจนละลาย \n" +
                "3.นำแป้งทั้งสองชนิดใส่อ่างผสม ตามด้วยผงฟู ทำแป้งเป็นหลุม นำมันเทศใส่ตรงกลาง นวดผสมให้เข้ากัน ค่อยๆใส่น้ำกะทิลงไป นวดให้เนียน\n" +
                "4.พักแป้งไว้ 15-20 นาที \n" +
                "5.ปั้นแป้งเป็นก้อนกลม รอน้ำมันร้อน ทะยอยใส่ไข่นกกระทาลงไป ใช้ไฟกลางไปทางอ่อน ต้องคอยคนตลอดเวลา ไม่งั้นก้อนจะไม่กลมสวย");
        b13.setIu("");

        b14 = new DataFood();
        b14.setName("ลูกชุบ");
        b14.setLmage((int)R.drawable.b14);
        b14.setName1("ส่วนผสม");
        b14.setData1("* ถั่วเขียวเลาะเปือก (นึ่ง) 500 กรัม\n" +
                "* น้ำตาลทราย 300 กรัม\n" +
                "* หัวกะทิ 1 ถ้วย\n" +
                "* สีผสมอาหารตามใจชอบ\n" +
                "* วุ้น");
        b14.setName2("ขั้นตอนการทำ");
        b14.setData2("1.นำถั่วเขียว น้ำตาลและกะทิ ปั่นรวมกันจนเนียน\n" +
                "2.เทส่วนผสมลงไปในกระทะแล้วเคี่ยวจนถั่วนั้นปั้นเป็นลูกได้\n" +
                "3.เตรียมสีผสมอาหารแยกไว้เป็นสีละถ้วย และเตรียมอุปกรณ์สำหรับเพ้นท์ เช่น พู่กัน และไม้แหลมสำหรับเสียบลูกชุบ\n" +
                "4.ปั้นขนมให้เป็นรูปผลไม้ต่างๆ จากนั้นก็เสียบด้วยไม้แหลม ปักพักไว้ก่อน\n" +
                "5.นำขนมที่ปั้นแล้ว ตกแต่งสีได้เลย แล้วนำไปตากให้สีแห้ง\n" +
                "6.ละลายวุ้นเตรียมไว้ เมื่อขนมพร้อมแล้วให้นำมาชุบกับวุ้น เคลือบให้ขนมเป็นขึ้นเงาสวย อาจจะจุ่มสองรอบเพื่อความหนามากยิ่งขึ้น");
        b14.setIu("");

        b15 = new DataFood();
        b15.setName("บัวลอย");
        b15.setLmage((int)R.drawable.b15);
        b15.setName1("ส่วนผสม");
        b15.setData1("* แป้งข้าวเหนียว 1000 กรัม (แบ่งเป็น 250 กรัม 4 ถ้วย)\n" +
                "* แป้งนวล 50 กรัม (แป้งข้าวเหนียว)\n" +
                "* น้ำกะทิ 1300 ml\n" +
                "* น้ำตาลโตนด 2 ก้อน\n" +
                "* น้ำตาลทราย 300 กรัม\n" +
                "* เกลือ ครึ่งช้อนชา\n" +
                "* สีผสมอาหารตามชอบ\n" +
                "* น้ำที่ใช้นวดแบ่ง 300 กรัม (แบ่งเป็น100 กรัมผสมสีตามชอบ แบ่งเป็น3 ถ้วย)\n" +
                "* น้ำกะทิ 100 กรัม");
        b15.setName2("ขั้นตอนการทำ");
        b15.setData2("1.นำแป้งมาล่อนใส่ภาชนะ จากนั้นทำหลุมตรงกลาง เทกะทิ 100 กรัมลงไปนวด ให้เนื้อเนียนเข้ากันดี จากนั้นปั้นเป็นก้อน ทำแบบนี้จนครบทุกสีที่เราต้องการ\n" +
                " จากนั้นปั้นเป็นลูกเล็กๆอีกที โรยแป้งนวลที่ภาชนะและตัวขนมด้วยนะคะ กันตัวขนมติดกัน\n" +
                "2.จาดนั้นมาตั้งน้ำให้เดือด พอน้ำเดือดใส่ตัวแป้งลงไปต้ม เมื่อต้มจนตัวแป้งลอยแล้วแสดงว่าตัวขนมสุกแล้วคะ จากนั้นตักขึ้นมาพักไว้ในน้ำเย็นอีกภาชนะนึง\n" +
                "3.ต่อมาเราตั้งน้ำกะทิ ใส่น้ำตาลทั้ง2 อย่างลงไป ตามด้วยเกลือ (ใครมีใบเตยสามารถนำมามัดเคี้ยวไปกับน้ำกะทิได้นะคะจะทำให้หอมกลิ่นใบเตยอ่อนๆ) \n" +
                "พอกะทิเดือด ให้เราชิมรสชาติตามความชอบ ถ้าได้รสชาติที่ชอบแล้วให้ตักตัวขนมของเราลงไปต้มกับน้ำกะทิ ปล่อยให้น้ำกะทิของเราเดือดดีจนตัวขนมลอยอีกครั้ง\n" +
                " เป็นอันใช้ได้คะ ปิดไฟตักใส่ถ้วยขนมพร้อมทานได้เลย");
        b15.setIu("");

        b16 = new DataFood();
        b16.setName("ขนมหม้อแกงเผือก");
        b16.setLmage((int)R.drawable.b16);
        b16.setName1("ส่วนผสม");
        b16.setData1("* ไข่เป็ด 5 ฟอง\n" +
                "* น้ำตาลปี๊ป 180 กรัม\n" +
                "* กะทิ (แบ่ง 2 ส่วน) 250 กรัม\n" +
                "* แป้งข้าวจ้าว 1.5 ช้อนโต๊ะ\n" +
                "* เกลือ 1/4 ช้อนชา\n" +
                "* เผือกต้มสุก 125 กรัม");
        b16.setName2("ขั้นตอนการทำ");
        b16.setData2("1.เตรียมส่วนผสม ขยำ ไข่,น้ำตาล,เกลือ,แป้ง,ใบเตย จนน้ำตาลละลาย ใส่ กะทิส่วนที่ 1 ขยำต่อให้เข้ากัน\n" +
                "2.กรองด้วยผ้าขาวบาง พักไว้\n" +
                "3.ปั่นกะทิ ส่วนที่ 2 กับเผือกต้มสุก จนเผือกละเอียด\n" +
                "4.นำส่วนผสมเผือก เทใส่หม้อไข่\n" +
                "5.ตั้งไฟอ่อนๆ คนเรื่อยๆ จนข้นเล็กน้อย\n" +
                "6.เทใส่ถ้วยฟอยล์ หรือพิมพ์สี่เหลี่ยม อบที่ไฟ 180 องศาเซลเซียส โดย ไฟล่าง 25 นาที แล้วเปลี่ยนเป็นไฟ บน-ล่าง 20 นาที สุดท้าย ไฟบนอย่างเดียว 5 นาที หรือจนขนมสีสวย");
        b16.setIu("");

        b17= new DataFood();
        b17.setName("ฝอยทอง");
        b17.setLmage((int)R.drawable.b17);
        b17.setName1("ส่วนผสม");
        b17.setData1("* ไข่เป็ด 5 ฟอง\n" +
                "* ไข่ไก่ 5 ฟอง\n" +
                "* น้ำตาลทราย 2 1/2 ถ้วยตวง\n" +
                "* น้ำลอยดอกมะลิ 1 1/2 ถ้วยตวง (หรือน้ำเปล่า)\n" +
                "* ไข่น้ำค้าง 2 ช้อนโต๊ะ (ไข่ขาวส่วนที่เป็นน้ำใสๆ ที่ติดอยู่กับเปลือกด้านป้าน)\n" +
                "* น้ำมันพืช 1 ช้อนชา\n" +
                "* กรวยทองเหลืองหรือกรวยใบตอง (สำหรับโรยไข่ในกระทะ)\n" +
                "* ไม้แหลม (สำหรับตักและพับฝอยทองในกระทะ)");
        b17.setName2("ขั้นตอนการทำ");
        b17.setData2("1.ต่อยไข่ไก่และไข่เป็ด เลือกเอาเฉพาะไข่แดง นำออกมากรองด้วยผ้าขาวบางเพื่อรีดเอาเยื่อออก\n" +
                "2.ผสมไข่แดง, ไข่น้ำค้างและน้ำมันพืชเข้าด้วยกัน คนจนผสมกันทั่ว\n" +
                "3.นำน้ำลอยดอกมะลิผสมกับน้ำตาลในกระทะทองเหลืองและนำไปตั้งไฟร้อนปานกลาง รอจนเดือด\n" +
                "4.นำส่วนผสมไข่แดงใส่ลงไปในกรวยและนำไปโรยในน้ำเชื่อมที่เดือด ทิ้งไว้ประมาณ 1 นาทีจนไข่สุกจึงใช้ไม้แหลม \n" +
                "สอยขึ้นและพับให้เป็นแพตามต้องการ");
        b17.setIu("");

        b18 = new DataFood();
        b18.setName("กะหรี่ปั๊บ");
        b18.setLmage((int)R.drawable.b18);
        b18.setName1("ส่วนผสม");
        b18.setData1("* น้ำมันรำข้าว 2 ช้อนโต๊ะ\n" +
                "* หอมใหญ่ 100 กรัม\n" +
                "* เนื้ออกไก่ 200 กรัม\n" +
                "* มันเทศ 300 กรัม\n" +
                "* พริกไทยป่น 1 ช้อนชา\n" +
                "* เกลือป่น 1 ช้อนชา\n" +
                "* ซอสปรุงรส 3 ช้อนโต๊ะ\n" +
                "* ผงกะหรี่ 1 1/2 ช้อนชา\n" +
                "* น้ำตาลทราย 1/4 ถ้วย\n" +
                "* น้ำเย็น 6 ช้อนโต๊ะ\n" +
                "* น้ำปูนใส 6 ช้อนโต๊ะ\n" +
                "* น้ำตาลทราย 1 ช้อนโต๊ะ\n" +
                "* เกลือ 1 ช้อนชา\n" +
                "* แป้งสาลีอเนกประสงค์ 270 กรัม (สำหรับชั้นแป้งนอก)\n" +
                "* น้ำมันรำข้าว 6 ช้อนโต๊ะ (สำหรับทำแป้งชั้นนอก)\n" +
                "* แป้งสาลีอเนกประสงค์ 140 กรัม (สำหรับแป้งชั้นใน)\n" +
                "* น้ำมันรำข้าว 6 ช้อนโต๊ะ (สำหรับแป้งชั้นใน)");
        b18.setName2("ขั้นตอนการทำ");
        b18.setData2("1.ผัดไส้เตรียมไว้ก่อน โดยใส่น้ำมันรำข้าวและหอมหัวใหญ่ลงไปผัด จากนั้นก็ใส่เนื้ออกไก่ และ มันเทศหั่นเต๋า\n" +
                "2.ปรุงรสด้วยพริกไทยป่น เกลือป่น ซอสปรุงรส ผงกะหรี่ และ น้ำตาลทราย ผัดให้เข้ากันจนทุกอย่างสุก\n" +
                "และ เหนียวสามารถนำมาปั้นได้ เสร็จแล้วตักใส่จานแล้ววางพักไว้\n" +
                "3.ผสมน้ำเย็นกับน้ำปูนใส ปรุงรสด้วยน้ำตาล และ เกลือ\n" +
                "4.มาผสมแป้งส่วนของแป้งชั้นนอกกันก่อน โดยเทแป้งลงไปในชามผสม เกลี่ยแป้งให้เป็นหลุมตรงกลาง เทน้ำปูนใสที่ผสมไว้ลงไป \n" +
                "ตามด้วยน้ำมันรำข้าว คนให้เข้ากันและนวดแป้งจนเนื้อเนียน แรปแล้วพักไว้\n" +
                "5.ผสมแป้งชั้นในกับน้ำมันรำข้าว คนให้เข้ากันแล้วนวดจนเนียน และแรปพักไว้\n" +
                "6.นำแป้งชั้นนอกออกมาตัดแบ่งเป็นชิ้นในสัดส่วนที่เท่ากัน และแป้งชั้นในก็นำออกมาตัดแบ่ง วางแยกกันไว้ (แนะนำให้ดูตามคลิป)\n" +
                "7.คลึงแป้งชั้นนอกและชั้นในเสร็จแล้ว นำไส้ที่ผัดไว้มาปั้นเป็นก้อนกลมๆ แล้วนำมาห่อกับแป้ง จับจีบให้เป็นรูปทรงของกะหรี่ปั๊บ\n" +
                "8.จากนั้นก็นำไปทอดให้เหลืองกรอบ เสร็จแล้วก็สะเด็ดน้ำไมันขึ้นมาวางพักไว้ ");
        b18.setIu("");

        b19 = new DataFood();
        b19.setName("จาวตาลเชื่อม");
        b19.setLmage((int)R.drawable.b19);
        b19.setName1("ส่วนผสม");
        b19.setData1("* จาวตาลสด 7 กิดลกรัม\n" +
                "* น้ำตาล 4 กิโลกรัม\n" +
                "* น้ำลอยดอกมะลิ 4 ถ้วยตวง");
        b19.setName2("ขั้นตอนการทำ");
        b19.setData2("1.ล้าง จาวตาล ให้ล้างให้สะอาด\n" +
                "2.ต้มน้ำให้เดือน นำ จาวตาล ลงไปต้ม ประมาณ 15 นาที จากนั้นใส่น้ำตาลลงไป\n" +
                "3.ต้มต่อให้เป็นน้ำเชื่อม เติมน้ำลอยดอกมะลิลงไปด้วย จากนั้นก็ต้มเชื่อมจาวตาลต่อ 20 นาที สังเกตุให้ลูกตาลเหลืองนุ่ม");
        b19.setIu("");

        b20 = new DataFood();
        b20.setName("สาคูไส้หมู");
        b20.setLmage((int)R.drawable.b20);
        b20.setName1("ส่วนผสม");
        b20.setData1("* สาคูเม็ดเล็ก 250 กรัม \n" +
                "* หมูสับ 270 กรัม \n" +
                "* รากผักชี 2 ราก\n" +
                "* กระเทียม 3 กลีบ \n" +
                "* พริกไทย 1 ช้อนชา\n" +
                "* หอมแดงสับ 5 หัว\n" +
                "* น้ำตาลปี๊บ 150 กรัม \n" +
                "* ซีอิ๊วขาว 1 ช้อนโต๊ะ \n" +
                "* ถั่วลิสงคั่วบด 55 กรัม \n" +
                "* หัวไชโป๊เค็ม 100 กรัม \n" +
                "* น้ำอัญชัน สำหรับแช่สาคู \n" +
                "* น้ำกระเจี๊ยบ สำหรับแช่สาคู \n" +
                "* กระเทียมเจียว สำหรับโรยหน้า\n" +
                "* ผักเคียงสำหรับจัดเสิร์ฟ\n");
        b20.setName2("ขั้นตอนการทำ");
        b20.setData2("1.นำรากผักชี กระเทียมและพริกไทย มาโขลกให้ละเอียด แล้วนำลงผัดในน้ำมันให้ส่งกลิ่นหอม ตามด้วยหอมแดง และหมูสับผัดจนพอสุก \n" +
                "2.ปรุงรสด้วยน้ำตาลปี๊บ ซีอิ๊วขาว ใส่ถั่วลิสงคั่วบด หัวไชโป๊เค็มลงไปผัดให้เข้ากัน แล้วพักไว้จนเย็น \n" +
                "3.นำสาคูมาแบ่งเป็น 3 ส่วน แล้วนำไปแช่ใน น้ำอัญชัน น้ำกระเจี๊ยบ และน้ำเปล่า เพื่อให้ได้สีที่แตกต่างกัน แช่ประมาณ 10 นาที แล้วรินน้ำออก \n" +
                "4.ปั้นไส้ที่พักไว้จนเย็นให้เป็นก้อน เส้นผ่านศูนย์กลางประมาณ 1 เซนติเมตร แล้วนำเม็ดสาคูที่แช่น้ำไว้มาห่อคลุมให้รอบ \n" +
                "5.ทาน้ำมันให้ทั่วลังถึง แล้วนำสาคูที่ปั้นไว้ไปนึ่ง 10 นาที หรือจนกระทั่งสาคูสุกใส \n" +
                "6.นำขึ้นคลุกน้ำมันกระเทียมเจียวแล้วจัดเสิร์ฟพร้อมกับผักเคียง ");
        b20.setIu("");





        order = (TextView) findViewById(R.id.MO1);
        order.setText(b1.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b1);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.MO2);
        order.setText(b2.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b2);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.MO3);
        order.setText(b3.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b3);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.MO4);
        order.setText(b4.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b4);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.MO5);
        order.setText(b5.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b5);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.MO6);
        order.setText(b6.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b6);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.MO7);
        order.setText(b7.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b7);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.MO8);
        order.setText(b8.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b8);
                startActivity(intent);
            }
        });


        order = (TextView) findViewById(R.id.MO9);
        order.setText(b9.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b9);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.MO10);
        order.setText(b10.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b10);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.MO11);
        order.setText(b11.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b11);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.MO12);
        order.setText(b12.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b12);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.MO13);
        order.setText(b13.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b13);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.MO14);
        order.setText(b14.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b14);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.MO15);
        order.setText(b15.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b15);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.MO16);
        order.setText(b17.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b17);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.MO18);
        order.setText(b18.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b18);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.MO19);
        order.setText(b19.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b19);
                startActivity(intent);
            }
        });

        order = (TextView) findViewById(R.id.MO20);
        order.setText(b20.getName());
        order.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent intent = new Intent(Main6Activity.this,Main3Activity.class);
                intent.putExtra("data", b20);
                startActivity(intent);
            }
        });



    }
}
